[
    {
        "genre": "Ambient",
        "description": "Emphasizes texture and tone over traditional musical structure, aimed at evoking a particular atmosphere or mood.",
        "subgenres": [
            {
                "name": "Ambient Americana",
                "description": "Ambient music made using traditional Americana and Country instrumentation."
            },
            {
                "name": "Ambient Noise Wall",
                "description": "Combines the static approach of Harsh Noise Wall with textures leaning towards Ambient music."
            },
            {
                "name": "Dark Ambient",
                "description": "Emphasizes an ominous, gloomy, and dissonant atmosphere.",
                "subgenres": [
                    {
                        "name": "Black Ambient",
                        "description": "Incorporates elements such as guitars, synthesizers, harsh or whispered vocals, raw production, or other elements associated with Black Metal and Dungeon Synth."
                    },
                    {
                        "name": "Ritual Ambient",
                        "description": "Dark, deep, disturbing, ritualistic, and occult atmosphere."
                    }
                ]
            },
            {
                "name": "Space Ambient",
                "description": "Flowing and relaxing synthesizer-based music derived from Progressive Electronic, often oriented around imagery of outer space."
            },
            {
                "name": "Tribal Ambient",
                "description": "Combines the theory and atmosphere of Ambient with traditional instruments and sounds from around the globe."
            }
        ]
    },
    {
        "genre": "Blues",
        "description": "Originated toward the end of the 19th century in African American communities in the United States, particularly the Deep South; drew on traditional Spirituals and Work Songs; highly influential to the whole of Western popular music.",
        "subgenres": [
            {
                "name": "Acoustic Blues",
                "description": "Developed out of Work Songs and Spirituals to become the most prominent early form of Blues.",
                "subgenres": [
                    {
                        "name": "Acoustic Chicago Blues",
                        "description": "Unplugged Blues made in the Chicago region, primarily during the 1930s and 1940s."
                    },
                    {
                        "name": "Acoustic Texas Blues",
                        "description": "Laid-back swing rhythms and guitar ornamentation, including solos."
                    }
                ]
            },
            {
                "name": "Jug Band",
                "description": "Usually features a jug as the bass instrument as well as other homemade (or easily affordable) instruments, such as kazoos and washboards."
            },
            {
                "name": "Piedmont Blues",
                "description": "Developed in the early 20th century in the southern Appalachian foothills and characterized by a syncopated but melodic Ragtime-based finger-picking acoustic guitar style."
            },
            {
                "name": "Boogie Woogie",
                "description": "Early, uptempo Blues featuring the piano as the main instrument, with soloing and improvisation played over the top of a repetitive eight note baseline."
            },
            {
                "name": "Country Blues",
                "description": "Various styles of Blues originating in the rural US South, typically relying on expressive vocal delivery and featuring simple, usually acoustic instrumentation.",
                "subgenres": [
                    {
                        "name": "Delta Blues",
                        "description": "One of the earliest forms of Blues, named for the Mississippi Delta region of the United States where it developed, with a highly rhythmic style and a typical 12-bar structure."
                    },
                    {
                        "name": "Hill Country Blues",
                        "description": "Emphasizes a steady hypnotic groove, sparse percussive and highly energetic guitar riffs, and often features meandering structures with unconventional and usually fewer chord changes compared to Delta Blues."
                    }
                ]
            },
            {
                "name": "Electric Blues",
                "description": "Major development in sound and reach of Blues when it became possible to amplify the instruments of small combos.",
                "subgenres": [
                    {
                        "name": "British Blues",
                        "description": "Heavily influenced by the burgeoning United States Blues scene, particularly Chicago Blues."
                    },
                    {
                        "name": "Chicago Blues",
                        "description": "Heavily inspired by old-time rural blues, transferring it into a small band setup, while maintaining the rough and gritty edges of its ancestry."
                    },
                    {
                        "name": "Electric Texas Blues",
                        "description": "Originating in (but not limited to) Texas; includes Jazz influences like Swing rhythms and sometimes the addition of a horn section."
                    },
                    {
                        "name": "Swamp Blues",
                        "description": "Originated in Baton Rouge, Louisiana in the 1950s, with a laid-back and relaxed sound that takes influence from Zydeco and Cajun Music."
                    }
                ]
            },
            {
                "name": "Fife and Drum Blues",
                "description": "Rooted in martial Fife and Drum Corps music, originated among Afro-American communities in Mississippi."
            },
            {
                "name": "Jump Blues",
                "description": "Emerged in the late 1930s with influence from jazz styles such as Swing and Big Band, featuring fast tempos and raucous performances."
            },
            {
                "name": "New Orleans Blues",
                "description": "Diverse scene in New Orleans since the beginning of the 20th century, commonly associated with a sound led by rollicking pianos with syncopated beats and backed by horns."
            },
            {
                "name": "Piano Blues",
                "description": "Played either solo or with the piano as the lead instrument of a small combo performing slow or mid-tempo blues ballads, as opposed to the commonly fast-paced Boogie Woogie."
            },
            {
                "name": "Soul Blues",
                "description": "Shares similarities with Soul and incorporates the eponymous soulful inflections of Gospel, Jump Blues and soul into the vocals."
            },
            {
                "name": "Vaudeville Blues",
                "description": "Vaudeville incorporating heavy Blues elements."
            }
        ]
    },
    {
        "genre": "Classical Music",
        "description": "Part of a broad generalization about the structure and function of music throughout history across the globe, describing traditions distinct from Traditional Folk Music and popular music.",
        "subgenres": [
            {
                "name": "Arabic Classical Music",
                "description": "Arabic Classical Music tradition, whose guidelines for modulation, rhythm, and tuning were set down in treatises in the 8th and 9th centuries, based around Islamic Modal Music.",
                "subgenres": [
                    {
                        "name": "Andalusian Classical Music",
                        "description": "Arabic Classical Music tradition that had its beginnings in Al-Andalus, the medieval Islamic Iberian peninsula, which later spread and developed in the Maghreb."
                    },
                    {
                        "name": "Iraqi Maqam",
                        "description": "Highly structured but semi-improvised and rhythmically complex compositions built around set structures which consist of specific maqam modes."
                    },
                    {
                        "name": "Sawt",
                        "description": "Poetic vocal form with complex rhythms, emotive singing, and distinctive lute-backed melodies commonly found in the Gulf region and based on a maqam system."
                    }
                ]
            },
            {
                "name": "Azerbaijani Mugham",
                "description": "Highly improvisational form of modal music characterized by the singing style and the themes of Azerbaijan's history."
            },
            {
                "name": "Arabic Classical Music",
                "description": "Arabic Classical Music tradition, whose guidelines for modulation, rhythm, and tuning were set down in treatises in the 8th and 9th centuries, based around Islamic Modal Music."
            },
            {
                "name": "Chinese Classical Music",
                "description": "Classical Music of China, encompassing royal court music as well as the Chinese Opera musical theatre traditions."
            },
            {
                "name": "Opera",
                "description": "European tradition which combines drama and distinctive vocal style in the context of Western Classical Music, usually performed as a theatrical work on stage.",
                "subgenres": [
                    {
                        "name": "Opera seria",
                        "description": "Italian Opera popular among European nobility and royalty throughout most of the 18th century, typified by its exaggerated dramatic flair and interspersed with dry recitative."
                    },
                    {
                        "name": "Operetta",
                        "description": "Light opera interspersed with spoken dialogues, being usually satirical and/or humorous in nature and centered around romantic plots and dancing scenes."
                    }
                ]
            },
            {
                "name": "Buganda Royal Court Music",
                "description": "Highest traditional and refined musical forms of Buganda, reserved for the Kabaka (the king of Buganda)."
            },
            {
                "name": "East Asian Classical Music",
                "description": "Covers all the forms of pan-East Asian Classical Music sharing origins in Chinese Classical Music.",
                "subgenres": [
                    {
                        "name": "Chinese Classical Music",
                        "description": "Classical Music of China, encompassing royal court music as well as the Chinese Opera musical theatre traditions.",
                        "subgenres": [
                            {
                                "name": "Baihua xiyue",
                                "description": "Mainly performed for funeral ceremonies of the Naxi ethnic group in the Yunnan province in China."
                            },
                            {
                                "name": "Chinese Opera",
                                "description": "Traditional Chinese theatre, existing in several regional variations, combining traditional instruments and vocals along with other art forms like Poetry, dance, acrobatics, and martial arts.",
                                "subgenres": [
                                    {
                                        "name": "Cantonese Opera",
                                        "description": "Chinese Opera that are sung in Cantonese."
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "name": "Japanese Classical Music",
                "description": "Classical music of Japan.",
                "subgenres": [
                    {
                        "name": "Gagaku",
                        "description": "One of the oldest forms of Japanese Classical Music, based on the pentatonic Yo scale, characterized by an elegant sound that is typically solemn, slow-paced, and resonant."
                    },
                    {
                        "name": "Shomyo",
                        "description": "Japanese Buddhist chant that utilizes the yo scale."
                    }
                ]
            },
            {
                "name": "Vietnamese Classical Music",
                "description": "Traditional court music of Vietnam, often performed by a twelve-instrument ensemble (for Dai Nhac music) or a fourteen-instrument ensemble (for Nha Nhac music).",
                "subgenres": [
                    {
                        "name": "Ca tru",
                        "description": "Sung poetry from northern Vietnam, performed by a female vocalist to the accompaniment of a three-stringed lute and percussion."
                    }
                ]
            },
            {
                "name": "Korean Classical Music",
                "description": "Classical Music of Korea.",
                "subgenres": [
                    {
                        "name": "Aak",
                        "description": "Korean Classical Music that dates back to the early 12th century."
                    }
                ]
            },
            {
                "name": "Persian Classical Music",
                "description": "Traditional art music of the Persian civilization."
            },
            {
                "name": "South Asian Classical Music",
                "description": "Meta-genre that covers the diverse forms of Classical Music from South Asia.",
                "subgenres": [
                    {
                        "name": "Carnatic Classical Music",
                        "description": "Culture shared by the Dravidian cultures in South India separate from regional folk genres."
                    }
                ]
            },
            {
                "name": "Southeast Asian Classical Music",
                "description": "Formal music developed in Southeast Asian countries.",
                "subgenres": [
                    {
                        "name": "Gamelan",
                        "description": "Originated in the island of Java, played by an ensemble typically consisting of metallophones and gongs, sometimes augmented with drums, flutes, and human voices."
                    }
                ]
            },
            {
                "name": "Western Classical Music",
                "description": "Broad range of art music associated with the aristocracy that originated in Europe around 500 AD.",
                "subgenres": [
                    {
                        "name": "Baroque Music",
                        "description": "Style of Western art music composed from approximately 1600 to 1750, embracing a grand and ornate approach."
                    }
                ]
            },
            {
                "name": "Renaissance Music",
                "description": "Encompasses Western Classical Music from the 15th to 16th centuries.",
                "subgenres": [
                    {
                        "name": "Madrigal",
                        "description": "Secular polyphonic music based around poetry and generally performed by unaccompanied vocal ensembles."
                    }
                ]
            },
            {
                "name": "Medieval Music",
                "description": "Includes a variety of Western music styles from the 5th to the 15th century.",
                "subgenres": [
                    {
                        "name": "Gregorian Chant",
                        "description": "Liturgical, monophonic chant that accompanied Mass and other rituals in Western Christianity."
                    }
                ]
            },
            {
                "name": "Modern Classical",
                "description": "Multitude of different compositional approaches beginning in the 20th century that deviate significantly from the previously-held tenets.",
                "subgenres": [
                    {
                        "name": "Expressionism",
                        "description": "Originating between the abandonment of tonality at the conclusion of the period of Romanticism and the creation of twelve-tone composition."
                    }
                ]
            }
        ]
    },
    {
        "genre": "Dance Music",
        "description": "Rooted in Disco and developed largely within Electronic Dance Music; emphasizes rhythm and is generally produced for play by DJs at clubs, parties, or festivals.",
        "subgenres": [
            {
                "name": "Alternative Dance",
                "description": "Incorporates rhythms and synthesizers from Electronic Dance Music within the context of Alternative Rock and related styles; predominantly popular in the 1990s.",
                "subgenres": [
                    {
                        "name": "Grebo",
                        "description": "Short-lived English subculture and associated music; raw, futuristic, sample-heavy form of Alternative Dance with a grungy guitar sound."
                    },
                    {
                        "name": "New Rave",
                        "description": "High energy mid-2000s form of Alternative Dance that combines Dance-Punk with elements of Electronic Dance Music styles like Electroclash and Electro House."
                    }
                ]
            },
            {
                "name": "Dance-Pop",
                "description": "Simple, yet catchy melodies and throbbing beats inspired initially by Disco and later various House styles.",
                "subgenres": [
                    {
                        "name": "Bubblegum Dance",
                        "description": "Playful, childlike style with a Bubblegum-like atmosphere that often incorporates high-pitched, light-hearted, and usually female-fronted vocals."
                    },
                    {
                        "name": "Disco polo",
                        "description": "Polish Dance-Pop, originally established from contemporary wedding / feast songs and Italo-Disco."
                    },
                    {
                        "name": "Freestyle",
                        "description": "Electro-influenced; developed in Latino communities in New York and Miami in the 1980s, especially dominated by Latin Freestyle and its Latin influences.",
                        "subgenres": [
                            {
                                "name": "Latin Freestyle",
                                "description": "Displays a heavy influence of Hispanic American Music alongside the Disco, Hip Hop, and Electro influences of Freestyle."
                            }
                        ]
                    },
                    {
                        "name": "Funk melody",
                        "description": "Light and melodic take on Funk brasileiro, developed alongside Funk carioca."
                    },
                    {
                        "name": "Romanian Popcorn",
                        "description": "Emerged in the second half of the 2000s in Romania, often featuring brass melodies and 'staccato' pluck grooves."
                    },
                    {
                        "name": "Tecnorumba",
                        "description": "Blend of the themes and singing style of Rumba flamenca with the most commercial forms of House, Techno, and Makina."
                    },
                    {
                        "name": "Township Bubblegum",
                        "description": "Synth-heavy Dance-Pop style popular in the South African townships in the 1980s and early 1990s."
                    }
                ]
            },
            {
                "name": "Disco",
                "description": "Combines the lush orchestration of Philly Soul and bass grooves of Funk with a four-on-the-floor rhythm.",
                "subgenres": [
                    {
                        "name": "Boogie",
                        "description": "Continuation of the Disco sound with increased influence from Funk, Synth Funk, and R&B and a slower tempo, often featuring drum machines and filter modulated synthesizers."
                    },
                    {
                        "name": "Electro-Disco",
                        "description": "Disco instrumentation is largely - if not entirely - replaced by synthesizers and augmented with futuristic elements such as the vocoder.",
                        "subgenres": [
                            {
                                "name": "Hi-NRG",
                                "description": "Emerged in the late 1970s and quickly became the most popular form of Electronic Dance Music in the LGBT club scenes of San Francisco and New York, characterized by its uptempo, high-energy sound."
                            },
                            {
                                "name": "Italo-Disco",
                                "description": "Produced primarily in Italy and is characterized by the use of synthesizers, drum machines, and sometimes vocoders to create a mechanical, Electronic version of Disco with futuristic atmosphere."
                            },
                            {
                                "name": "Space Disco",
                                "description": "Emerged in Europe in the mid-to-late 1970s, characterized by layers of oscillating synth, space-oriented sound effects, and a futuristic sound inspired by contemporary sci-fi media."
                            }
                        ]
                    },
                    {
                        "name": "Euro-Disco",
                        "description": "European style that moved away from the genre's Rhythm & Blues and Soul roots, speeding up the tempo and adding Electronic instruments like synthesizers and drum machines as a backing for more melodic Europop-influenced vocals."
                    },
                    {
                        "name": "Latin Disco",
                        "description": "Disco that incorporates elements from Hispanic American Music styles."
                    },
                    {
                        "name": "Mutant Disco",
                        "description": "Danceable basslines, syncopated grooves, and angular guitar riffs, characterized by a spirit of experimentation and integration of disparate sounds."
                    },
                    {
                        "name": "Nu-Disco",
                        "description": "21st-century trend mixing modern, polished Electronic production with the aesthetics, structures, and lively, organic beats of 1970s and 1980s Disco."
                    }
                ]
            },
            {
                "name": "Electronic Dance Music",
                "description": "Broad category for subgenres mainly derived from Disco, featuring Electronic sounds, synthesizers, drum machines and varying BPM ranges.",
                "subgenres": [
                    {
                        "name": "Breakbeat",
                        "description": "An umbrella of affiliated Electronic Dance Music styles broadly characterized by prominent syncopated drum patterns (called breakbeats) that emerged from Breakbeat Hardcore's initial influence, not including styles directly related to Drum and Bass and Jungle.",
                        "subgenres": [
                            {
                                "name": "Acid Breaks",
                                "description": "Incorporates prominent 'squelching', resonant low pass filter sounds typical to Acid House, and often other 'trippy' effects into intense, syncopated, broken rhythms in the tempos of 110-150 BPM."
                            },
                            {
                                "name": "Baltimore Club",
                                "description": "Drew on the 'booty bass' syncopation of Miami Bass, combined with Breakbeat rhythms around 130 BPM and chopped up vocal samples as found in Ghetto House."
                            },
                            {
                                "name": "Big Beat",
                                "description": "Popular in Britain during the late 1990s, driven by edited breakbeats and prominent basslines."
                            },
                            {
                                "name": "Breakbeat Hardcore",
                                "description": "Originated from the combination of sampled breakbeats and energetic rhythms with the 'rave' influences set by early-1990s Techno and Acid House, including upbeat 'stab' riffing and sample-based production."
                            },
                            {
                                "name": "Breakbeat Kota",
                                "description": "Indonesian style that slows down the syncopated rhythms of Funkot to moderate tempos around 130 BPM."
                            },
                            {
                                "name": "Florida Breaks",
                                "description": "Developed during the mid-1990s, combining major influences of Hip Hop derivatives such as Miami Bass and Electro along with elements of 1990s Electronic Dance Music genres like House or Techno."
                            },
                            {
                                "name": "Nu Skool Breaks",
                                "description": "Developed in the late 1990s and early 2000s; combines elements from Drum and Bass, UK Garage, and Techno with breakbeat."
                            },
                            {
                                "name": "Progressive Breaks",
                                "description": "Derivative of Progressive House that incorporates its lush, melodic synth leads and atmospheres into Breakbeat's syncopated and broken rhythms."
                            },
                            {
                                "name": "Psybreaks",
                                "description": "Uses Psytrance-derived sound design, such as squelchy sounds and psychedelic effects."
                            },
                            {
                                "name": "West Coast Breaks",
                                "description": "Combines the earlier breakbeats of Hip Hop and early Breakbeat or even Miami Bass, with various 1990s Electronic Dance Music genres like Trance and Techno."
                            }
                        ]
                    },
                    {
                        "name": "Drum and Bass",
                        "description": "Typified by fast, syncopated breakbeat patterns (often sampled or programmed) with prominent basslines, commonly within the 160-180 BPM range.",
                        "subgenres": [
                            {
                                "name": "Atmospheric Drum and Bass",
                                "description": "Prominent in the mid-1990s, distinguished by its use of faster, de-emphasized breakbeats and a greater focus on more melodic elements like slow, warm basslines and atmospheric melodies inspired by Ambient and Ambient House."
                            },
                            {
                                "name": "Dancefloor Drum and Bass",
                                "description": "Emerged in the late 2000s and early 2010s as a form of simpler, lighter and more melodic Drum and Bass in comparison to many of the drum and bass genres which preceded it."
                            },
                            {
                                "name": "Darkstep",
                                "description": "Hard, uptempo and uses heavy breakbeats, Post-Industrial-influenced sound design, and horror movie samples to create a sinister, claustrophobic atmosphere."
                            },
                            {
                                "name": "Drumfunk",
                                "description": "Focuses on complex drum beats made to emulate live recordings."
                            },
                            {
                                "name": "Drumstep",
                                "description": "Dancefloor-friendly, loud, and heavy combination of the drum programming of Jump-Up with the half-time tempo and midrange LFO wobble of Brostep."
                            },
                            {
                                "name": "Dubwise Drum and Bass",
                                "description": "Implementing Reggae and Dub influences, usually vocal dubs, delay effects, and reggae instrumentation, with the clean production and rhythms of post-2000s styles."
                            },
                            {
                                "name": "Footwork Jungle",
                                "description": "Combining Footwork's archetypal percussion, skittering drum fills, handclaps, and syncopated rhythms, with Drum and Bass drum programming and breakbeats, merging the two into unconventional, frantic drumming and dense, off-kilter rhythms."
                            },
                            {
                                "name": "Halftime",
                                "description": "Offshoot of Drum and Bass (mainly Neurofunk) characterized by off-kilter rhythms playing at around 80-85 BPM (half of normal DnB pace), influenced by Dubstep, Wonky, Trap [EDM], and Hip Hop."
                            },
                            {
                                "name": "Hardstep",
                                "description": "Very compressed and sparse drumming, extensive use of kick drums and gritty, minimalistic production style with emphasis on simple, deep, modulated bass patterns."
                            },
                            {
                                "name": "Jazzstep",
                                "description": "Combines the rhythm and speed of Drum and Bass with the melodies, composition, and instrumentation of Jazz."
                            },
                            {
                                "name": "Jump-Up",
                                "description": "Emerged in the mid-1990s, characterized by loud 'wobbling' basslines, simpler drum loops, and a light-hearted and warm sound."
                            },
                            {
                                "name": "Jungle",
                                "description": "Developed in the early 1990s from Breakbeat Hardcore, featuring rapid, chaotic-sounding breakbeats and strong basslines; known as the forerunner of most Drum and Bass styles."
                            },
                            {
                                "name": "Liquid Drum and Bass",
                                "description": "Atmospheric and melodic genre that developed in the early 2000s; utilizes polished and smooth production, simpler structures, and originally sampled Funk and Soul."
                            },
                            {
                                "name": "Minimal Drum and Bass",
                                "description": "Drum and Bass which strips down the sound as far as it can go without wholly ceasing to be drum and bass."
                            },
                            {
                                "name": "Neurofunk",
                                "description": "Focuses on technical songwriting with warped, complex bass sounds, distorted and modulated synths (often with repeated stabs over the basslines), and dark but clean production."
                            },
                            {
                                "name": "Techstep",
                                "description": "Futuristic, dark, and gritty sound; quantized and compressed drum breaks, distorted bass lines, and a focus on a sci-fi atmosphere and sampling sources."
                            },
                            {
                                "name": "Trancestep",
                                "description": "Combination of Trance melodies and structure with the breakbeats, fast tempos, and rolling basslines of Drum and Bass."
                            }
                        ]
                    },
                    {
                        "name": "Dubstep",
                        "description": "Characterized by half-time syncopated and sparse beats set around 140 BPM with heavy sub-basses; emerged in South London in the early 2000s.",
                        "subgenres": [
                            {
                                "name": "Brostep",
                                "description": "Offshoot of Dubstep which replaces its sub-bass-oriented sound with an emphasis on catchy or aggressive mid-range melodies.",
                                "subgenres": [
                                    {
                                        "name": "Briddim",
                                        "description": "Combining the kick-clap rhythms and syncopation of Riddim with Brostep sound design."
                                    },
                                    {
                                        "name": "Colour Bass",
                                        "description": "Combines aggressive wobbling basses with the euphoric drops of Melodic Dubstep and Future Bass."
                                    },
                                    {
                                        "name": "Deathstep",
                                        "description": "Darker, heavier form of Brostep that uses 'machine gun' basses, atonal synths, and elements from genres like Death Metal and Metalcore."
                                    },
                                    {
                                        "name": "Drumstep",
                                        "description": "Dancefloor-friendly, loud, and heavy combination of the drum programming of Jump-Up with the half-time tempo and midrange LFO wobble of Brostep."
                                    },
                                    {
                                        "name": "Tearout [Brostep]",
                                        "description": "Heavy and distorted, closely affiliated with Deathstep and other styles of Brostep."
                                    }
                                ]
                            },
                            {
                                "name": "Chillstep",
                                "description": "Relaxed Dubstep influenced by Downtempo and Ambient."
                            },
                            {
                                "name": "Dungeon Sound",
                                "description": "Commonly features dark textures, spatial production, and midrange basses."
                            },
                            {
                                "name": "Melodic Dubstep",
                                "description": "Melodious, tuneful drops, rich, lush synth leads, powerful stretched chords, and light and harmonious sound design."
                            },
                            {
                                "name": "Purple Sound",
                                "description": "Emerged in the late 2000s out of the Dubstep scene of the time, incorporating synth leads and basslines inspired by 1980s Synth Funk and 1990s G-Funk, and Video Game Music, into a rhythmic palette mostly derived from dubstep and Grime."
                            },
                            {
                                "name": "Riddim",
                                "description": "Heavy use of repetition and wet, metallic sound design."
                            },
                            {
                                "name": "Tearout",
                                "description": "Emerged in the late 2000s, characterized by a gritty, aggressive sound and closely affiliated with early, deep Dubstep."
                            }
                        ]
                    },
                    {
                        "name": "East Coast Club",
                        "description": "Group of club styles from the US East Coast that combines Miami Bass rhythms with influence from Breakbeat and Ghetto House.",
                        "subgenres": [
                            {
                                "name": "Baltimore Club",
                                "description": "Drew on the 'booty bass' syncopation of Miami Bass, combined with Breakbeat rhythms around 130 BPM and chopped up vocal samples as found in Ghetto House."
                            },
                            {
                                "name": "Jersey Club",
                                "description": "Emerged in Newark in the late 2000s; features fast tempos, hard kicks, and less prominent breakbeats."
                            },
                            {
                                "name": "Philly Club",
                                "description": "Builds on Baltimore Club with a faster tempo and sometimes influences from more modern genres like Trap [EDM]."
                            }
                        ]
                    },
                    {
                        "name": "EBM",
                        "description": "Melodic and beat-driven Electronic Dance Music take on Post-Industrial that developed in the 1980s.",
                        "subgenres": [
                            {
                                "name": "Dark Electro",
                                "description": "Emerged in the early 1990s in Europe, combining EBM beats with the abrasiveness of old school Industrial but with a greater focus on a horror-inspired atmosphere and harsh, distorted vocals."
                            },
                            {
                                "name": "Futurepop",
                                "description": "Derivative of EBM, retaining its apocalyptic worldview but incorporating heavy influence from the melodic style of Synthpop."
                            },
                            {
                                "name": "New Beat",
                                "description": "Underground dance music which originated in Belgium around 1987, tending to resemble slower, harder EBM."
                            }
                        ]
                    },
                    {
                        "name": "Electro",
                        "description": "Syncopated rhythms programmed on the Roland TR-808 drum machine, often resembling Funk breaks, along with simple funky basslines.",
                        "subgenres": [
                            {
                                "name": "Skweee",
                                "description": "Originated among Nordic artists in the mid-2000s, inspired by elements of Synth Funk, Hip Hop, and IDM."
                            },
                            {
                                "name": "Electroclash",
                                "description": "Draws from 1980s styles such as Electro, New Wave, and Electro-Disco combined with Techno, resulting in minimal, throbbing beats and basslines, buzzing synthesizer parts, vocoders and often monotone, half-spoken, half-sung vocals."
                            },
                            {
                                "name": "Electro-Disco",
                                "description": "Disco instrumentation is largely - if not entirely - replaced by synthesizers and augmented with futuristic elements such as the vocoder."
                            },
                            {
                                "name": "Electro Latino",
                                "description": "Mixes elements of Merengue and Reggaetón with polished production from mainstream House subgenres; often shares traits with Latin Pop, having anthemic melodies and verse-chorus structures."
                            },
                            {
                                "name": "Electro Swing",
                                "description": "Upbeat, energetic style that splices Swing with Electronic Dance Music, looking to recapture the atmosphere of late 1920s to mid-1940s Jazz within a more updated club-friendly medium."
                            }
                        ]
                    },
                    {
                        "name": "Eurodance",
                        "description": "Takes elements of Euro-Disco, House, Techno, and Hi-NRG while featuring on-beat kick, hi-hat and snare sounds at around 110 to 150 bpm.",
                        "subgenres": [
                            {
                                "name": "Bubblegum Dance",
                                "description": "Playful, childlike style with a Bubblegum-like atmosphere that often incorporates high-pitched, light-hearted, and usually female-fronted vocals."
                            },
                            {
                                "name": "Italo Dance",
                                "description": "Appeared in the 1990s after the decline of Italo-Disco, featuring rhythmic influence from that genre."
                            }
                        ]
                    },
                    {
                        "name": "Footwork",
                        "description": "Extensive use of drum fills, tom drums, handclaps, and snares within fast-paced, highly syncopated beats not bound to a 4/4 kick rhythm.",
                        "subgenres": [
                            {
                                "name": "Footwork Jungle",
                                "description": "Combining Footwork's archetypal percussion, skittering drum fills, handclaps, and syncopated rhythms, with Drum and Bass drum programming and breakbeats, merging the two into unconventional, frantic drumming and dense, off-kilter rhythms."
                            }
                        ]
                    },
                    {
                        "name": "Glitch Hop",
                        "description": "Tempos around 100-110 BPM, swung, bouncy drum patterns, and a focus on upbeat, danceable drops and buildups.",
                        "subgenres": [
                            {
                                "name": "Ghetto Funk",
                                "description": "Rich sampling, drawing from classic Hip Hop as well as from Funk and Soul, and strong midtempo break grooves."
                            },
                            {
                                "name": "Neurohop",
                                "description": "Features the complex bass of Neurofunk and a frantic and mechanical sound design."
                            }
                        ]
                    },
                    {
                        "name": "Grime",
                        "description": "UK Garage-derived production style characterized by dark, fast-paced, often aggressive beats that commonly features fast-paced MCing.",
                        "subgenres": [
                            {
                                "name": "Neo-Grime",
                                "description": "Mixes Wave with Grime and other forms of UK Electronic music."
                            },
                            {
                                "name": "Weightless",
                                "description": "Typically instrumental, leftfield Grime style characterized by sparse, 'weightless' percussion and spectral, atmospheric production."
                            }
                        ]
                    },
                    {
                        "name": "Hardcore",
                        "description": "Umbrella term for a wide variety of extremely fast-paced, energetic Electronic Dance Music styles that have been developed since the early 1990s.",
                        "subgenres": [
                            {
                                "name": "Acidcore",
                                "description": "Developed out of the 1990s Acid Techno scene utilizing its prominence of 'acid' TB-303 bassline sequences into more intense rhythms derived from earlier Hardcore [EDM], Gabber and Trance music."
                            },
                            {
                                "name": "Belgian Techno",
                                "description": "Early form of Hardcore [EDM], resulting from the further evolution of New Beat due to the strong influence of Techno and EBM."
                            },
                            {
                                "name": "Breakbeat Hardcore",
                                "description": "Originated from the combination of sampled breakbeats and energetic rhythms with the 'rave' influences set by early-1990s Techno and Acid House, including upbeat 'stab' riffing and sample-based production."
                            },
                            {
                                "name": "Breakcore",
                                "description": "Mixes Hardcore [EDM] with cut-up, complex, and frequently noisy breakbeats at very high tempos inspired by Jungle and Drum and Bass, often with heavy use of sampling."
                            },
                            {
                                "name": "Crossbreed",
                                "description": "Harsh and dense mixture of Darkstep with Hardcore [EDM] developed in the late 2000s."
                            },
                            {
                                "name": "Darkcore",
                                "description": "Aggressive, dark, and often midtempo with influences from Doomcore, Industrial Hardcore, and Nu Style Gabber."
                            },
                            {
                                "name": "Deathchant Hardcore",
                                "description": "Took shape in the UK in the late 1990s and early 2000s, characterized by rapid rhythms with Gabber-influenced kicks, frequent use of breakbeats and Hip Hop-inspired sampling."
                            },
                            {
                                "name": "Digital Hardcore",
                                "description": "High-tempo fusion of Hardcore Punk and Electronic, combining harsh vocals and electric guitars of the former with electronic instruments."
                            },
                            {
                                "name": "Doomcore",
                                "description": "Often somber and contemplative in mood, a feature achieved by the common use of long-stretched ambient pads, and sometimes even samples of screaming and other 'spooky' sounds."
                            },
                            {
                                "name": "Freeform Hardcore",
                                "description": "Emerged in the mid-1990s, combining fast and hard-hitting rhythms with heavy influence from the synthesizers of Trance."
                            },
                            {
                                "name": "Frenchcore",
                                "description": "Off-beat, bouncy rhythmic patterns and tempos around the 200 BPM range."
                            },
                            {
                                "name": "Gabber",
                                "description": "Fast-paced and energetic, often in the 160-220 BPM range, with a hallmark of a distinctive distorted kick sound."
                            },
                            {
                                "name": "Happy Hardcore",
                                "description": "Emerged in the 1990s from the UK Breakbeat Hardcore scene; characterized by saccharine vocals, uplifting piano riffs and spacey effects, gradually developing to emphasize extremely fast-paced four-on-the-floor beats."
                            },
                            {
                                "name": "Hardtek",
                                "description": "Modern hard dance-influenced version of the 'tribecore' sound featuring deep alternating basses and festival EDM-influenced drops."
                            },
                            {
                                "name": "Industrial Hardcore",
                                "description": "Fuses the sonic palettes and aesthetics of Industrial & Noise with the intense rhythms of Gabber, Speedcore, Doomcore and other subsequent styles."
                            },
                            {
                                "name": "J-core",
                                "description": "More energetic and eclectic form of Japanese Hardcore [EDM]."
                            },
                            {
                                "name": "Speedcore",
                                "description": "Exceedingly fast tempos, frequently above 300 BPM, and often aggressive themes and samples."
                            },
                            {
                                "name": "Terrorcore",
                                "description": "Utilizes rhythms from earlier Gabber with a faster BPM (usually no more than 300) and darker approach."
                            },
                            {
                                "name": "Uptempo Hardcore",
                                "description": "Utilizes lo-fi production, harsh kicks, and elements borrowed from Rawstyle and other gritty Hardcore [EDM] styles while usually sitting at around 185-220 BPM."
                            }
                        ]
                    },
                    {
                        "name": "Hard Dance",
                        "description": "Umbrella term for EDM mainly developed out of Hard Trance and UK Hard House; usually characterized by fast tempos, hard kick drums and a 'bouncy' syncopated groove.",
                        "subgenres": [
                            {
                                "name": "Hardstyle",
                                "description": "Hard, four-on-the-floor kick drums, fast tempo around 150 BPM, reverse bass and harsh, distorted synths."
                            },
                            {
                                "name": "Hardtek",
                                "description": "Modern hard dance-influenced version of the 'tribecore' sound featuring deep alternating basses and festival EDM-influenced drops."
                            },
                            {
                                "name": "Hard Trance",
                                "description": "Rave-oriented form of Trance infusing its atmospheres with faster, thumping rhythms and strong melodic / bassline sections, initially spawning out of the first wave in early-1990s Western Europe."
                            },
                            {
                                "name": "Jumpstyle",
                                "description": "Features a heavy 909 kick drum, four-on-the-floor beat, and a tempo between 140 and 150 BPM."
                            },
                            {
                                "name": "Lento violento",
                                "description": "Features a 'slow and violent' sound between 70-120 BPM with hard kicks inspired by Hardcore [EDM] and Hardstyle."
                            },
                            {
                                "name": "NRG",
                                "description": "Derived from UK Hard House; featuring darker, more anthemic Trance beats and a tempo of 155-165 BPM."
                            },
                            {
                                "name": "UK Hardcore",
                                "description": "Four-on-the-floor beat around 175 BPM, thick, prominent basslines, and uplifting synth leads, with a cleaner and more accessible sound than other forms of Hardcore [EDM]."
                            },
                            {
                                "name": "UK Hard House",
                                "description": "Defined by offbeat bass patterns, compressed 909-style drums, buildup-drop structures, hoover sounds, and tempos between 120 and 155 BPM."
                            },
                            {
                                "name": "Hard Drum",
                                "description": "Highly percussive, syncopated rhythms, influences from global contemporary genres, and lack of melodic elements, with a tempo lingering between 130 BPM."
                            },
                            {
                                "name": "Hardvapour",
                                "description": "Influenced by Hardcore [EDM] and Techno and made in response to the Vaporwave movement."
                            },
                            {
                                "name": "Hardwave",
                                "description": "Harder, festival-oriented offshoot of Wave, combining its 'reese' basses and icy synths with Trap [EDM] drum patterns, build-up-drop structures, and fuller sound influenced by Trance and Hardstyle."
                            }
                        ]
                    },
                    {
                        "name": "Hardstyle",
                        "description": "A genre characterized by its hard four-on-the-floor beats, aggressive synths, and up to 150 BPM.",
                        "subgenres": [
                            {
                                "name": "Dubstyle",
                                "description": "Characterized by the incorporation of the half-time rhythms and wobbly basslines of Dubstep."
                            },
                            {
                                "name": "Euphoric Hardstyle",
                                "description": "Melodic, more lighthearted, and accessible Hardstyle."
                            },
                            {
                                "name": "Psystyle",
                                "description": "Prominent Psytrance influences, especially the basslines and energy of mainstream psytrance."
                            },
                            {
                                "name": "Rawstyle",
                                "description": "Incorporates earlier Hardstyle and Hardcore [EDM] influences into the sound of 2010s hardstyle, creating a distinctly harsh, simplistic, raw, and dark sound, with fast BPM."
                            }
                        ]
                    }
                ]
            },
            {
                "name": "House",
                "description": "A genre of Electronic Dance Music characterized by a repetitive four on the floor beat and a tempo of 120 to 130 beats per minute.",
                "subgenres": [
                    {
                        "name": "Acid House",
                        "description": "Emerged in the mid-1980s, characterized by repetitive basslines created with the distinctive modulated 'squelching' sound of the Roland TB-303 synthesizer."
                    },
                    {
                        "name": "Afro House",
                        "description": "Emerged by fusing Deep House with Southern African Music, characterized by hypnotizing drum patterns of shakers and congas, often sampled African vocals or soulful original features, and spiritual, organic, melodic atmosphere."
                    },
                    {
                        "name": "Amapiano",
                        "description": "House from South Africa deriving from previous popular genres including Gqom, Kwaito, and Deep House."
                    },
                    {
                        "name": "Ambient House",
                        "description": "Primarily British genre developed in the 1990s with beats, synthesizers, and vocals in styles similar to House, treated with effects that are often described as 'dream-like' or 'chilled out'."
                    },
                    {
                        "name": "Bass House",
                        "description": "Busy, punchy percussion, prominent basslines and dirty, distorted synths resembling other bass music genres, with influences including Brostep, Fidget House, Bassline, Speed Garage, and Tech House."
                    },
                    {
                        "name": "Big Room House",
                        "description": "Energetic, festival-oriented style characterized by heavy reverb, intense build-ups, strong kicks, minimalistic drop melodies, and sparse, raw breakdowns."
                    },
                    {
                        "name": "Bubbling House",
                        "description": "Developed in the Netherlands in the 2000s, combining the older style of Bubbling with more modern House, especially Dutch House."
                    },
                    {
                        "name": "Changa tuki",
                        "description": "Emerged in Caracas; highly influenced by 1990s Techno and Tribal House, featuring fast tempos, strident synthesizers, hard-thumping percussion lines, and plenty of breakbeats."
                    },
                    {
                        "name": "Chicago Hard House",
                        "description": "Originated from Chicago around the mid-1990s as a development of Ghetto House, emphasizing hard-hitting, off-beat drum patterns, fast tempos, and lack of melodies."
                    },
                    {
                        "name": "Chicago House",
                        "description": "Umbrella term for a broad variety of House that originated from Chicago in the (mostly mid-to-late) 1980s and early 90s."
                    },
                    {
                        "name": "Deep House",
                        "description": "Emerged in the United States during the mid-1980s, featuring a relaxed tempo and influences from Jazz, Funk, and Soul."
                    },
                    {
                        "name": "Diva House",
                        "description": "Dominant, anthemic female vocals, common use of piano stabs, and energetic, driving four-on-the-floor rhythms."
                    },
                    {
                        "name": "Electro House",
                        "description": "Warm analog basslines, punchy percussion, crisp high-pitched synthesizer leads, and clipped vocal samples."
                    },
                    {
                        "name": "Dutch House",
                        "description": "High-pitched wonky synth melodies and heavy influence from Fidget House which developed in the Netherlands around 2007-08."
                    },
                    {
                        "name": "Fidget House",
                        "description": "Makes heavy use of Breakbeat Hardcore-esque synth stabs, pitch bending of basslines, and cut-up vocal samples, as well as glitchy, or 'choppy', 4/4 rhythms."
                    },
                    {
                        "name": "Euro House",
                        "description": "Vocal-focused style emerging in the late 1980s in Europe, developing in parallel with Eurodance."
                    },
                    {
                        "name": "French House",
                        "description": "Originated in France in the mid-1990s, characterized by the use of filtered (low-pass, phaser, etc.) samples of Funk and Disco."
                    },
                    {
                        "name": "Funky House",
                        "description": "Funky, warm, catchy basslines on top of looped Funk or Disco samples, resulting in an upbeat, bouncy, and pacy groove."
                    },
                    {
                        "name": "Future Funk",
                        "description": "Sample-based form of House which formed out of Vaporwave in the early 2010s."
                    },
                    {
                        "name": "Future House",
                        "description": "Features distinctive metallic-sounding drops and frequency-modulated basslines at around 120-130 BPM."
                    },
                    {
                        "name": "Garage House",
                        "description": "Disco-influenced style of House that developed in the 1980s, incorporating elements of Gospel, Soul, and Dub, before evolving into a more upbeat style that prominently features crisp syncopated hi-hats and synth stabs."
                    },
                    {
                        "name": "Ghetto House",
                        "description": "Rough sound based around minimal drum machine-driven tracks and heavy usage of vocal samples."
                    },
                    {
                        "name": "G-House",
                        "description": "Deep, dark form of House music that primarily incorporates rap samples or original rapping on top of minimal, bassy beats."
                    },
                    {
                        "name": "Gqom",
                        "description": "Evolved from South African House, specifically Kwaito; often described as a more minimal and raw version."
                    },
                    {
                        "name": "Hip House",
                        "description": "Incorporates production elements of early Hip Hop and usually rapping into 1980s House."
                    },
                    {
                        "name": "Italo House",
                        "description": "Originated in Italy during the late 1980s, making use of anthemic pianos, diva vocals, and Dance-Pop song structures."
                    },
                    {
                        "name": "Jackin' House",
                        "description": "Punchy, 'shuffly' percussion, strong grooves, funky basslines, and chopped-up samples."
                    },
                    {
                        "name": "Latin House",
                        "description": "Emerged in the second half of the 1980s, blending four-on-the-floor beats with Hispanic American Music influences from Puerto Rico, Mexico, Cuba, Dominica, and Colombia."
                    },
                    {
                        "name": "Melodic House",
                        "description": "Arpeggiated synth lines, focus on a chilled and laid-back atmosphere, and influence from genres such as Progressive House and Deep House."
                    },
                    {
                        "name": "Microhouse",
                        "description": "Stripped-down, minimal form of House, originating in the late 90s, which takes influence from Minimal Techno, Glitch and IDM."
                    },
                    {
                        "name": "Organic House",
                        "description": "Subtle drums and grooves, slow tempos, and acoustic, traditional instrumentation, resulting in an organic, warm sound and spiritual atmosphere."
                    },
                    {
                        "name": "Outsider House",
                        "description": "Mostly derived from Deep House; intentional use of rough, lo-fi production, often utilizing a mix of analog/analog-like and digital instrumentation."
                    },
                    {
                        "name": "Phonk House",
                        "description": "Merges Drift Phonk's nocturnal atmospheres, cowbell melodies, vocal samples, and energetic production, with House rhythms and tempos, characterized by a banging and upbeat sound."
                    },
                    {
                        "name": "Progressive House",
                        "description": "Trance-influenced strain of House that grew to prominence in the early 1990s, using polished production and gradual progressions."
                    },
                    {
                        "name": "Romanian Popcorn",
                        "description": "Emerged in the second half of the 2000s in Romania, often featuring brass melodies and 'staccato' pluck grooves."
                    },
                    {
                        "name": "Speed Garage",
                        "description": "Primarily British style that paved the way for UK Garage, combining cut-up vocal samples and sped up four-on-the-floor Garage House rhythms with Jungle-esque basslines."
                    },
                    {
                        "name": "Tech House",
                        "description": "Emerged in the mid-1990s taking influences from Techno, broadly characterized by minimalistic and repetitive melodies, focus on the bassline, and constant groove recognizable by prominent off-beat hi-hats."
                    },
                    {
                        "name": "Tribal House",
                        "description": "Prominent, syncopated rhythms of tribal drums such as toms and bongos on top of a House beat, usually resulting in a percussive, energetic sound, while ranging in mood."
                    },
                    {
                        "name": "Tropical House",
                        "description": "Offshoot of Deep House featuring slow tempos around 100-115 BPM, light percussion and acoustic instrumentation, setting out to create a relaxed, summery, beach-like atmosphere."
                    },
                    {
                        "name": "UK Hard House",
                        "description": "Defined by offbeat bass patterns, compressed 909-style drums, buildup-drop structures, hoover sounds, and tempos between 120 and 155 BPM."
                    },
                    {
                        "name": "Vinahouse",
                        "description": "Fast-paced House popular in Vietnam, remixing Vietnamese melodies."
                    }
                ]
            },
            {
                "name": "Techno",
                "description": "A genre of Electronic Dance Music that emerged in Detroit, MI, in the United States during the mid-to-late 1980s.",
                "subgenres": [
                    {
                        "name": "Ambient Techno",
                        "description": "Blends the mechanical, repetitive beats of Techno with atmospheres and textures inspired by Ambient music, resulting in slower tempos and more understated rhythms."
                    },
                    {
                        "name": "Belgian Techno",
                        "description": "Early form of Hardcore [EDM], resulting from the further evolution of New Beat due to the strong influence of Techno and EBM."
                    },
                    {
                        "name": "Bleep Techno",
                        "description": "Established in the late 1980s in the breakdancing and early rave scene of Yorkshire in the North of England, notable for its 'bleepy' synth lines and heavy sub-bass."
                    },
                    {
                        "name": "Detroit Techno",
                        "description": "Features a signature mechanical, detached sound that echoed the atmosphere of Detroit's nightlife and incorporated influences from Electro, Chicago House, as well as Synthpop and Electro-Disco."
                    },
                    {
                        "name": "Freetekno",
                        "description": "Originated in the early 1990s, commonly played at free parties in Europe, and features a repetitive pounding kick drum at tempos of 170 BPM or above."
                    },
                    {
                        "name": "Hardgroove Techno",
                        "description": "Popular in the early 2000s; features layered shuffling percussion."
                    },
                    {
                        "name": "Hard Techno",
                        "description": "Typically rave-oriented form characterized by hard, prominent kick drums, pounding rhythms, fast tempos around 140-160 BPM, and aggressive, often distorted sounds."
                    },
                    {
                        "name": "Industrial Techno",
                        "description": "Harder, darker style of Techno which draws parallels with factories and the rhythm of machinery."
                    },
                    {
                        "name": "Melodic Techno",
                        "description": "Trance-influenced subgenre that was established in the mid-to-late 2010s, characterized by gradually progressing structure, and hypnotizing, atmospheric sound with arpeggiated, minor melodies, playing at around 120-125 BPM."
                    },
                    {
                        "name": "Minimal Techno",
                        "description": "Stripped-down and sparse, often featuring a dark sound and a slow, steady development through the track.",
                        "subgenres": [
                            {
                                "name": "Dub Techno",
                                "description": "Fuses elements of Minimal Techno with characteristics of Dub."
                            }
                        ]
                    },
                    {
                        "name": "Peak Time Techno",
                        "description": "Hard, dynamic, energetic and accessible subgenre featuring strong kicks, massive dirty synths, tempos around 130 BPM, more suspenseful structures with breaks and build-ups, and big, modern, festival-oriented sound; rose to high popularity in the late 2010s."
                    },
                    {
                        "name": "Wonky Techno",
                        "description": "Strays from the standard beat of Techno, opting for a more fractured sound."
                    }
                ]
            },
            {
                "name": "Trance",
                "description": "A genre of Electronic Dance Music that developed in the early 1990s, characterized by a tempo lying between 125 and 150 bpm (beats per minute), repeating melodic phrases, and a musical form that builds up and down throughout a track.",
                "subgenres": [
                    {
                        "name": "Acid Trance",
                        "description": "Incorporates 'squelching' acid basslines into Trance's evolving structure."
                    },
                    {
                        "name": "Big Room Trance",
                        "description": "Incorporates production features associated with Big Room House and dirty, distorted leads influenced by Electro House, Dutch House and Hardstyle."
                    },
                    {
                        "name": "Dream Trance",
                        "description": "Slow tempo (about 130 BPM) with strong roots in Progressive House, using beats typical of Eurodance and Dance-Pop; emphasizes a laid-back, carefree, and dreamlike sound."
                    },
                    {
                        "name": "Euro-Trance",
                        "description": "More accessible, usually vocal-driven subgenre that emerged as a fusion with Eurodance, featuring its catchy, upbeat melodies and offbeat basslines while keeping the fast tempos."
                    },
                    {
                        "name": "Hard Trance",
                        "description": "Rave-oriented form of Trance infusing its atmospheres with faster, thumping rhythms and strong melodic / bassline sections, initially spawning out of the first wave in early-1990s Western Europe."
                    },
                    {
                        "name": "Ibiza Trance",
                        "description": "Builds on the relaxing island atmosphere of Balearic Beat, though with a slightly faster tempo of around 130 BPM."
                    },
                    {
                        "name": "NRG",
                        "description": "Derived from UK Hard House; featuring darker, more anthemic Trance beats and a tempo of 155-165 BPM."
                    },
                    {
                        "name": "Progressive Trance",
                        "description": "Combination of Trance and Progressive House which emerged in Western Europe in the early to mid-1990s."
                    },
                    {
                        "name": "Psytrance",
                        "description": "Trance with a psychedelic feel and energetic sound, based around influences from Goa Trance and Acid Trance."
                    },
                    {
                        "name": "Tech Trance",
                        "description": "Late 1990s-emerging subgenre characterized by energetic percussion with loud kicks, filtered hi-hats and tribal drums; side-chained, detuned and repetitive leads, as well as other raw, distorted, and complex sounds influenced by Techno, Hard Trance and Electro House."
                    },
                    {
                        "name": "Uplifting Trance",
                        "description": "Euphoric melodies, buildup-breakdown-anthem structures, common usage of supersaws, and a BPM range of usually around 135-142."
                    },
                    {
                        "name": "Vocal Trance",
                        "description": "Melodic, polished, Pop-like, and vocal-focused with around 120-145 BPM and frequent overlap with Progressive Trance, Uplifting Trance, and Euro-Trance."
                    }
                ]
            },
            {
                "name": "Trap",
                "description": "A subgenre of Hip Hop music that originated in the Southern United States during the early 1990s.",
                "subgenres": [
                    {
                        "name": "Festival Trap",
                        "description": "Massive, sub-bass-heavy drops with simple melodies, synth leads and production influenced by Big Room House; highly popular from 2013 to 2015."
                    },
                    {
                        "name": "Hard Trap",
                        "description": "Often abrasive subgenre of Trap [EDM] with heavy influence from Hardstyle."
                    },
                    {
                        "name": "Heaven Trap",
                        "description": "Blends Trap [EDM]’s signature percussion and sub-basses with euphoric, uplifting, melodious drops prominently derived from Festival Progressive House, contrary to the gritty, 'dirty' nature of other EDM trap styles."
                    },
                    {
                        "name": "Hybrid Trap",
                        "description": "Blending Trap [EDM]'s typical percussion and sub-basses with major influences from heavy bass music genres, and in particular, metallic, gritty, and off-kilter sound design, originally derived from Brostep."
                    },
                    {
                        "name": "Twerk",
                        "description": "Fast-paced; draws influence from Bounce and Miami Bass."
                    }
                ]
            },
            {
                "name": "UK Garage",
                "description": "A genre of electronic music originating from England in the early 1990s, combining elements of House, Dance-pop, and R&B.",
                "subgenres": [
                    {
                        "name": "2-Step",
                        "description": "Originating in London and popular in the late 1990s; jittery, shuffling rhythms rarely following a four-on-the-floor pattern."
                    },
                    {
                        "name": "Bassline",
                        "description": "Strong emphasis on intricate basslines as well as four-on-the-floor beat patterns."
                    },
                    {
                        "name": "Breakstep",
                        "description": "Differentiated from other UK Garage subgenres by its use of hard-hitting Breakbeat rhythms, as well as its focus on heavy, rolling basslines."
                    },
                    {
                        "name": "Future Garage",
                        "description": "Derivative of UK Garage combining influences from the rhythms of late 1990s and early 2000s 2-Step with novel moods and production approaches, commonly featuring jittery, broken rhythms, vocal chops, and warm synth pads and plucks."
                    },
                    {
                        "name": "Speed Garage",
                        "description": "Primarily British style that paved the way for UK Garage, combining cut-up vocal samples and sped up four-on-the-floor Garage House rhythms with Jungle-esque basslines."
                    }
                ]
            },
            {
                "name": "Miami Bass",
                "description": "Sustained Roland TR-808 kick drums and faster tempos, along with a distinct Electro influence."
            }
        ]
    },
    {
        "genre": "Electronic",
        "description": "Uses non-traditional electronic instrumentation and sound manipulation technology as the primary backbone of a composition.",
        "subgenres": [
            {
                "name": "Bit Music",
                "description": "Created by sound chips, cards, and sequencers found in video game consoles, personal computers, and arcade machines, as well as synthesizers emulating these sounds.",
                "subgenres": [
                    {
                        "name": "Chiptune",
                        "description": "Used primarily in the 1980s within the context of 8-bit Video Game Music, combining simple synthesized waveforms and noise in a compositionally limited but overtly melodic style."
                    },
                    {
                        "name": "FM Synthesis",
                        "description": "Sound synthesis that combines the simple waveforms of Chiptune with modulating oscillators to create a bouncier synthesizer sound that would be used in arcade cabinets and home video game consoles like the Sega Mega Drive/Genesis in the late 1980s."
                    },
                    {
                        "name": "MIDI Music",
                        "description": "Intended for real-time sequenced playback via MIDI protocol on MIDI devices and used primarily in 1990s PC Video Game Music, arranger keyboards and karaoke."
                    },
                    {
                        "name": "Sequencer & Tracker",
                        "description": "Composed for early home computer and game consoles from the late 1980s to the late 1990s, primarily for video game soundtracks."
                    }
                ]
            },
            {
                "name": "Chillout",
                "description": "Broad category of many relaxed styles of Electronic music which predominantly draw influence from Electronic Dance Music subgenres and Ambient.",
                "subgenres": [
                    {
                        "name": "Ambient Dub",
                        "description": "Takes cues from Ambient and Dub reggae, featuring the atmosphere of the former and the Jamaican-style basslines, percussion, and psychedelic production techniques of the latter."
                    },
                    {
                        "name": "Ambient House",
                        "description": "Primarily British genre developed in the 1990s with beats, synthesizers, and vocals in styles similar to House, treated with effects that are often described as 'dream-like' or 'chilled out'."
                    },
                    {
                        "name": "Ambient Trance",
                        "description": "Emerged in the mid-1990s mainly in the form of Chillout remixes of Trance tracks; incorporates its arpeggiated synthesizer sound into Downtempo and Ambient contexts."
                    },
                    {
                        "name": "Balearic Beat",
                        "description": "Variety of relaxed, laid-back music that originates from the Balearic Islands off the coast of Spain, and particularly the club scene in Ibiza."
                    },
                    {
                        "name": "Barber Beats",
                        "description": "Borrows elements from Downtempo, Trip Hop, and Instrumental Hip Hop; emulates 1990s and 2000s Chillout music."
                    },
                    {
                        "name": "Downtempo",
                        "description": "Atmospheric and groove-based with relaxed tempos and mellow beats.",
                        "subgenres": [
                            {
                                "name": "Psybient",
                                "description": "Heavy influence from Psytrance and Goa Trance incorporated in an atmospheric Ambient context."
                            },
                            {
                                "name": "Trip Hop",
                                "description": "Evokes a surreal, trippy, dreamy, and sometimes dark atmosphere with offbeat turntable scratches, light vocal melodies, and Hip Hop-influenced beats."
                            }
                        ]
                    }
                ]
            },
            {
                "name": "Dungeon Synth",
                "description": "Focuses on evoking epic and atmospheric soundscapes commonly associated with fantasy and medieval settings through the usage of synthesizers, keyboards, and drum machines.",
                "subgenres": [
                    {
                        "name": "Comfy Synth",
                        "description": "Calm, peaceful and soothing sounds, as well as nostalgic, sentimental, or childish atmospheres and aesthetics; often incorporates wholesome themes while utilizing lo-fi or hazy recordings and influences from New Age."
                    },
                    {
                        "name": "Winter Synth",
                        "description": "Cold, minimalistic, and repetitive soundscapes, commonly invoking imagery of winter."
                    }
                ]
            },
            {
                "name": "Electroacoustic",
                "description": "Manipulation and processing of sound sources to create atmospheric pieces.",
                "subgenres": [
                    {
                        "name": "Acousmatic Music",
                        "description": "Fixed-media Electroacoustic music designed to be reproduced by multiple loudspeakers without the presence of instrumentalists and visual cues."
                    },
                    {
                        "name": "EAI",
                        "description": "Slow paced, physical, textured aesthetic - often created using unconventional instruments processed through a computer."
                    },
                    {
                        "name": "Musique concrète",
                        "description": "Manipulation of recorded sounds, mostly Field Recordings, natural sounds, and real-world noises, as a process of abstracting 'concrete' sounds, or 'sound objects', from their acoustic origins."
                    }
                ]
            },
            {
                "name": "Electro-Industrial",
                "description": "Formed in the late 1980s and early 1990s; grew out of a combination of EBM and Industrial.",
                "subgenres": [
                    {
                        "name": "Dark Electro",
                        "description": "Emerged in the early 1990s in Europe, combining EBM beats with the abrasiveness of old school Industrial but with a greater focus on a horror-inspired atmosphere and harsh, distorted vocals."
                    },
                    {
                        "name": "Aggrotech",
                        "description": "Based on the dark atmosphere of Dark Electro, typically characterized by more aggressive Hardcore [EDM]-influenced beats and harsh/distorted vocals."
                    }
                ]
            },
            {
                "name": "Indietronica",
                "description": "Leftfield or DIY approach characterised by simpler Pop-informed melodies, often incorporating vocals or live instrumentation alongside Electronic production.",
                "subgenres": [
                    {
                        "name": "Chillwave",
                        "description": "Emulates vintage aesthetics and popular musical styles of the 1980s/1990s altered by modern recording technology to create a hazy dreamlike atmosphere."
                    },
                    {
                        "name": "Chillsynth",
                        "description": "Mixes Synthwave with major Chillwave elements, characterized by a dreamy and relaxed sound."
                    },
                    {
                        "name": "Glitch Pop",
                        "description": "Incorporates elements of more experimental Electronic styles like IDM and Glitch."
                    },
                    {
                        "name": "Picopop",
                        "description": "Originated in the early 2000s as an offshoot of the Japanese Shibuya-kei movement when artists introduced more prominent 'bleepy' electronic elements and faster tempos."
                    }
                ]
            },
            {
                "name": "Latin Electronic",
                "description": "Combines Electronic with Latin American influences; started at the end of the 1990s.",
                "subgenres": [
                    {
                        "name": "Changa tuki",
                        "description": "Emerged in Caracas; highly influenced by 1990s Techno and Tribal House, featuring fast tempos, strident synthesizers, hard-thumping percussion lines, and plenty of breakbeats."
                    },
                    {
                        "name": "Digital Cumbia",
                        "description": "Mixes an Electronic sound into traditional Cumbia through influences from House, Dancehall, Hyphy, and Dubstep."
                    },
                    {
                        "name": "Electro latino",
                        "description": "Mixes elements of Merengue and Reggaetón with polished production from mainstream House subgenres; often shares traits with Latin Pop, having anthemic melodies and verse-chorus structures."
                    },
                    {
                        "name": "Electrotango",
                        "description": "Combines Tango rhythms and melodies with Electronic music."
                    },
                    {
                        "name": "Nortec",
                        "description": "Samples and synthesizes Mexican styles like Banda sinaloense and Norteño into a sound related to IDM and House."
                    },
                    {
                        "name": "Tribal Guarachero",
                        "description": "Features percussion from Cumbia and Mexican Folk Music with upbeat Electro House-derived production and fast, triplet-oriented rhythmic patterns."
                    }
                ]
            },
            {
                "name": "Minimal Wave",
                "description": "Retrospective term for more Electronic and minimal forms of New Wave, Post-Punk, Synthpop, and related styles, tending towards a more sparse and lo-fi sound.",
                "subgenres": [
                    {
                        "name": "Minimal Synth",
                        "description": "Minimal and distinctly DIY take on Synthpop with a bleak and naive aesthetic."
                    }
                ]
            },
            {
                "name": "Power Electronics",
                "description": "Waves of feedback, screeching analog synthesizers, and harsh, screamed vocals.",
                "subgenres": [
                    {
                        "name": "Death Industrial",
                        "description": "Combines the abrasive textures of Noise and Industrial music with dark, brooding drones and atmospheres."
                    }
                ]
            },
            {
                "name": "Progressive Electronic",
                "description": "Synthesizer-driven genre focusing on developing, often longform compositions and drawing inspiration from various sources such as Progressive Rock, Western Classical Music, and Ambient.",
                "subgenres": [
                    {
                        "name": "Berlin School",
                        "description": "Atmospheric, multi-layered synthesizer textures; pioneered in Berlin in the 1970s as an offshoot to the Krautrock movement."
                    }
                ]
            },
            {
                "name": "Synth Pop",
                "description": "Led by a prominent, melodic synthesizer sound, often with reverberated drum machine patterns that create a distinct atmospheric feel commonly associated with the 1980s.",
                "subgenres": [
                    {
                        "name": "Futurepop",
                        "description": "Derivative of EBM, retaining its apocalyptic worldview but incorporating heavy influence from the melodic style of Synthpop."
                    },
                    {
                        "name": "Pon-chak disco",
                        "description": "Heavily influenced by Electro-Disco, featuring cheap 'electronic organ' synth leads and minimalistic, repetitive rhythms."
                    },
                    {
                        "name": "Techno kayō",
                        "description": "Offshoot of 1980s Kayōkyoku and Idol kayō incorporating characteristics from Synthpop."
                    }
                ]
            },
            {
                "name": "Synthwave",
                "description": "Rooted in 1980s synth music, characterized by large, throbbing 'retro' synths and visual elements, often features upbeat percussion and/or epic, cinematic atmospheres.",
                "subgenres": [
                    {
                        "name": "Chillsynth",
                        "description": "Mixes Synthwave with major Chillwave elements, characterized by a dreamy and relaxed sound."
                    },
                    {
                        "name": "Darksynth",
                        "description": "Incorporates atmospheric Horror Synth and faster tempos into a much heavier and darker sound."
                    }
                ]
            },
            {
                "name": "Vapor",
                "description": "Meta-genre beginning with the rise of Vaporwave and the aesthetics that it spawned.",
                "subgenres": [
                    {
                        "name": "Chillsynth",
                        "description": "Mixes Synthwave with major Chillwave elements, characterized by a dreamy and relaxed sound."
                    },
                    {
                        "name": "Darksynth",
                        "description": "Incorporates atmospheric Horror Synth and faster tempos into a much heavier and darker sound."
                    },
                    {
                        "name": "Broken Transmission",
                        "description": "Uses samples taken from TV broadcasts, advertising, film, radio, and other sources - often slowing down and manipulating the sound heavily."
                    },
                    {
                        "name": "Eccojams",
                        "description": "Simple, prototypical Vaporwave style, heavily influenced by Chopped and Screwed and Glitch, that features short, slowed-down, lyric-focused, sampled loops smothered in reverb and continuously repeated, usually taken from late 20th century music."
                    },
                    {
                        "name": "Mallsoft",
                        "description": "Blends the main characteristics of Vaporwave with what can be described as background/elevator music."
                    },
                    {
                        "name": "Slushwave",
                        "description": "Specializes in a distinct form of sample manipulation rooted in Vaporwave, heavily utilizing multi-layered effects to create a specific 'slushy', hypnagogic sound usually sequenced in soft, repetitive Ambient-based soundscapes."
                    }
                ]
            },
            {
                "name": "Wave",
                "description": "Melancholic, atmospheric, melodic beats, defined by its Trap and Cloud Rap influence, ethereal and cold production style, and abundant use of sub bass.",
                "subgenres": [
                    {
                        "name": "Hardwave",
                        "description": "Harder, festival-oriented offshoot of Wave, combining its 'reese' basses and icy synths with Trap [EDM] drum patterns, build-up-drop structures, and fuller sound influenced by Trance and Hardstyle."
                    },
                    {
                        "name": "Neo-Grime",
                        "description": "Mixes Wave with Grime and other forms of UK Electronic music."
                    }
                ]
            }
        ]
    },
    {
        "genre": "Experimental",
        "description": "Most radical approaches throughout history, featuring non-traditional production methods resulting in sounds and styles that go largely beyond traditional boundaries.",
        "subgenres": {
            "Conducted Improvisation": {
                "description": "Collective improvisation directed by a conductor."
            },
            "Data Sonification": {
                "description": "Usage of data to create sound, soundscapes and music mostly as a way to illustrate its information."
            },
            "Drone": {
                "description": "Characterized by a focus on long, sustained tones and tone clusters, or repetition of single notes."
            },
            "Electroacoustic": {
                "description": "Manipulation and processing of sound sources to create atmospheric pieces.",
                "subgenres": {
                    "Acousmatic Music": {
                        "description": "Fixed-media Electroacoustic music designed to be reproduced by multiple loudspeakers without the presence of instrumentalists and visual cues."
                    },
                    "EAI": {
                        "description": "Slow paced, physical, textured aesthetic - often created using unconventional instruments processed through a computer."
                    },
                    "Musique concrète": {
                        "description": "Manipulation of recorded sounds, mostly Field Recordings, natural sounds, and real-world noises, as a process of abstracting 'concrete' sounds, or 'sound objects', from their acoustic origins."
                    }
                }
            },
            "Free Improvisation": {
                "description": "Improvised music which, in descending from Free Jazz and classical Indeterminacy, further abandons the prescriptions of harmonic or rhythmic structures which characterized those genres.",
                "subgenres": {
                    "EAI": {
                        "description": "Slow paced, physical, textured aesthetic - often created using unconventional instruments processed through a computer."
                    }
                }
            },
            "Futurism": {
                "description": "Radical and militant attitude, rejection of Western Classical Music and traditional criteria of craft, non-conformity, and a fascination with machines."
            },
            "Glitch": {
                "description": "Uses abstract sound design and malfunctioning electronics—CD skips, data corruption, and hardware noise—as main compositional elements."
            },
            "Indeterminacy": {
                "description": "Leaves elements of composition, performance, or both up to chance."
            },
            "Industrial": {
                "description": "Emerged out of Punk and avant-garde art movements in the mid-1970s, often characterized by a bleak, mechanical atmosphere, the use of metallic percussion as well as other unconventional instruments, and extensive use of sampling influenced by Musique concrète.",
                "subgenres": {
                    "Power Electronics": {
                        "description": "Waves of feedback, screeching analog synthesizers, and harsh, screamed vocals.",
                        "subgenres": {
                            "Death Industrial": {
                                "description": "Combines the abrasive textures of Noise and Industrial music with dark, brooding drones and atmospheres."
                            },
                            "Power Noise": {
                                "description": "Combines looped samples of Noise with Electronic rhythms."
                            }
                        }
                    }
                }
            },
            "Microsound": {
                "description": "Usage of sounds on an incredibly small scale."
            },
            "Modern Creative": {
                "description": "Style of semi-improvisation that derives heavily from both the composition of Modern Classical and the techniques of Avant-Garde Jazz."
            },
            "Musique concrète instrumentale": {
                "description": "Acoustic, through-composed Classical Music that relies heavily on unconventional instrumental techniques."
            },
            "Noise": {
                "description": "Strays away from conventional structure, tonality, and composition and consists predominantly of noise.",
                "subgenres": {
                    "Ambient Noise Wall": {
                        "description": "Combines the static approach of Harsh Noise Wall with textures leaning towards Ambient music."
                    },
                    "Black Noise": {
                        "description": "Incorporates unconventional sounds with overpowering or constant Noise and Black Metal elements, often being heavily texture-oriented, abrasive, dissonant, atonal, or repetitive."
                    },
                    "Gorenoise": {
                        "description": "Combines and subverts Goregrind and Grindcore with brash Noise and even faster drum tempos."
                    },
                    "Harsh Noise": {
                        "description": "Highly aggressive walls of sound that assault the listener.",
                        "subgenres": {
                            "Harsh Noise Wall": {
                                "description": "Harsh, distorted walls of sound that feature few dynamic variations and often take the form of long compositions with little to no change or progression over time."
                            }
                        }
                    }
                }
            },
            "Plunderphonics": {
                "Description": "Compositional technique of utilizing and manipulating one or more recognizable recordings to create a new composition."
            },
            "Reductionism": {
                "Description": "Experimental music that centers around quiet dynamics and use of silence.",
                "Subgenres": {
                    "Lowercase": {
                        "Description": "Uses very quiet sounds, often using silence to juxtapose these sounds so as to amplify their intensity."
                    },
                    "Onkyo": {
                        "Description": "Exploration of the physical traits of sound rather than music as expression."
                    }
                }
            },
            "Sound Art": {
                "Description": "Incorporates elements from Experimental music and visual arts, with sound utilized as its primary medium and subject."
            },
            "Sound Collage": {
                "Description": "Sound pieces are layered and essentially 'glued' together to create an auditory art piece.",
                "Subgenres": {
                    "Epic Collage": {
                        "Description": "Defined by its Deconstructed Club sonic palette and its cinematic proportions."
                    }
                }
            }
        }
    },
    {
        "Genre": "Industrial & Noise",
        "Description": "Umbrella encompassing Noise and Industrial, as well as later derivatives that combine the latter aesthetics with other styles and in more accessible directions which fall under Post-Industrial.",
        "Subgenres": {
            "Industrial": {
                "Description": "Emerged out of Punk and avant-garde art movements in the mid-1970s, often characterized by a bleak, mechanical atmosphere, the use of metallic percussion as well as other unconventional instruments, and extensive use of sampling influenced by Musique concrète.",
                "Subgenres": {
                    "Power Electronics": {
                        "Description": "Waves of feedback, screeching analog synthesizers, and harsh, screamed vocals.",
                        "Subgenres": {
                            "Death Industrial": {
                                "Description": "Combines the abrasive textures of Noise and Industrial music with dark, brooding drones and atmospheres."
                            }
                        }
                    }
                }
            },
            "Noise": {
                "Description": "Strays away from conventional structure, tonality, and composition and consists predominantly of noise.",
                "Subgenres": {
                    "Ambient Noise Wall": {
                        "Description": "Combines the static approach of Harsh Noise Wall with textures leaning towards Ambient music."
                    },
                    "Black Noise": {
                        "Description": "Incorporates unconventional sounds with overpowering or constant Noise and Black Metal elements, often being heavily texture-oriented, abrasive, dissonant, atonal, or repetitive."
                    },
                    "Gorenoise": {
                        "Description": "Combines and subverts Goregrind and Grindcore with brash Noise and even faster drum tempos."
                    },
                    "Harsh Noise": {
                        "Description": "Highly aggressive walls of sound that assault the listener.",
                        "Subgenres": {
                            "Harsh Noise Wall": {
                                "Description": "Harsh, distorted walls of sound that feature few dynamic variations and often take the form of long compositions with little to no change or progression over time."
                            }
                        }
                    },
                    "Power Electronics": {
                        "Description": "Waves of feedback, screeching analog synthesizers, and harsh, screamed vocals.",
                        "Subgenres": {
                            "Death Industrial": {
                                "Description": "Combines the abrasive textures of Noise and Industrial music with dark, brooding drones and atmospheres."
                            }
                        }
                    },
                    "Power Noise": {
                        "Description": "Combines looped samples of Noise with Electronic rhythms."
                    }
                }
            },
            "Post-Industrial": {
                "Description": "Umbrella group of genres that combine the dark, mechanical aesthetic of early Industrial music with more accessible genres, such as Rock and Electronic Dance Music.",
                "Subgenres": {
                    "Dark Ambient": {
                        "Description": "Emphasizes an ominous, gloomy, and dissonant atmosphere.",
                        "Subgenres": {
                            "Black Ambient": {
                                "Description": "Incorporates elements such as guitars, synthesizers, harsh or whispered vocals, raw production, or other elements associated with Black Metal and Dungeon Synth."
                            },
                            "Ritual Ambient": {
                                "Description": "Dark, deep, disturbing, ritualistic, and occult atmosphere."
                            }
                        }
                    },
                    "Deconstructed Club": {
                        "Description": "Emerged in the 2010s as the hybridization of diverse Electronic Dance Music genres with an abrasive Post-Industrial sound."
                    },
                    "EBM": {
                        "Description": "Melodic and beat-driven Electronic Dance Music take on Post-Industrial that developed in the 1980s.",
                        "Subgenres": {
                            "Dark Electro": {
                                "Description": "Emerged in the early 1990s in Europe, combining EBM beats with the abrasiveness of old school Industrial but with a greater focus on a horror-inspired atmosphere and harsh, distorted vocals.",
                                "Subgenres": {
                                    "Aggrotech": {
                                        "Description": "Based on the dark atmosphere of Dark Electro, typically characterized by more aggressive Hardcore [EDM]-influenced beats and harsh/distorted vocals."
                                    }
                                }
                            },
                            "Futurepop": {
                                "Description": "Derivative of EBM, retaining its apocalyptic worldview but incorporating heavy influence from the melodic style of Synthpop.",
                                "Subgenres": {
                                    "New Beat": {
                                        "Description": "Underground dance music which originated in Belgium around 1987, tending to resemble slower, harder EBM."
                                    }
                                }
                            }
                        }
                    },
                    "Electro-Industrial": {
                        "Description": "Formed in the late 1980s and early 1990s; grew out of a combination of EBM and Industrial."
                    },
                    "Epic Collage": {
                        "Description": "Defined by its Deconstructed Club sonic palette and its cinematic proportions."
                    },
                    "Industrial Hardcore": {
                        "Description": "Fuses the sonic palettes and aesthetics of Industrial & Noise with the intense rhythms of Gabber, Speedcore, Doomcore and other subsequent styles."
                    },
                    "Industrial Hip Hop": {
                        "Description": "Incorporates harsh elements inspired by Industrial music such as blaring, noisy synths, distorted and metallic percussion, as well as more aggressive and off-kilter rapping styles."
                    },
                    "Industrial Metal": {
                        "Description": "Incorporates the abrasive and heavy sound from Industrial into a Metal context by using elements from Post-Industrial like synthesizers and drum machines.",
                        "Subgenres": {
                            "Cyber Metal": {
                                "Description": "Originated around 1999, influenced by EBM and Aggrotech with more melodic and less repetitive riffs as well as harsh vocals."
                            },
                            "Neue Deutsche Härte": {
                                "Description": "Alternative Metal and Industrial Metal that incorporates various aspects of electronic music, specifically Electronic Dance Music."
                            }
                        }
                    },
                    "Industrial Rock": {
                        "Description": "Incorporates abrasive guitars and synthesizers inspired by Industrial and various Post-Industrial styles."
                    },
                    "Industrial Techno": {
                        "Description": "Harder, darker style of Techno which draws parallels with factories and the rhythm of machinery.",
                        "Subgenres": {
                            "Birmingham Sound": {
                                "Description": "Cold, mechanical, and hypnotic tracks, typically lacking the harsher and noisier elements of later Industrial Techno."
                            }
                        }
                    },
                    "Martial Industrial": {
                        "Description": "Incorporates elements of traditional European military marches with Neoclassical Darkwave, Dark Ambient, Industrial, and Neofolk."
                    },
                    "Power Noise": {
                        "Description": "Combines looped samples of Noise with Electronic rhythms."
                    }
                }
            }
        }
    },
    {
        "Genre": "Jazz",
        "Description": "Originating in African American communities in the Southern United States around the turn of the 20th century, building on New Orleans Brass Band ensemble and influences from Ragtime and Blues to become a very popular style by the emergence of Swing in the 1930s.",
        "Subgenres": {
            "Afro-Jazz": {
                "Description": "African-styled percussion and rhythms."
            },
            "Arabic Jazz": {
                "Description": "Blending of Arabic Music and Jazz."
            },
            "Avant-Garde Jazz": {
                "Description": "Combines traditional or mainstream Jazz stylings with non-traditional techniques of avant-garde art music by experimenting with characteristics such as rhythm, harmony, structure, melody, and instrumentation.",
                "Subgenres": {
                    "Experimental Big Band": {
                        "Description": "Dispensing with traditional Jazz structures and Swing sounds, instead performing Avant-Garde Jazz and pushing the boundaries of the medium.",
                        "Subgenres": {
                            "Free Jazz": {
                                "Description": "Attempts to break free from the conventions and patterns of earlier Jazz subgenres through the use of elements such as dissonance, atonality, and free-flowing rhythmic structures.",
                                "Subgenres": {
                                    "European Free Jazz": {
                                        "Description": "Arose in Europe in the late 1960s and early 1970s, moving even further from the Jazz tradition by often dropping the swinging rhythm, taking liberties with the use of atonality and noise."
                                    }
                                }
                            }
                        }
                    },
                    "Yass": {
                        "Description": "Coined in the early 1990s by a group of Polish Avant-Garde Jazz musicians to describe their cross-genre, often arrhythmic, improvised sound."
                    }
                }
            },
            "Bebop": {
                "Description": "Fast tempos, improvisation, irregular melodic phrasing, and complex harmonies and chord structures."
            },
            "Big Band": {
                "Description": "Commonly associated with the golden era of Swing in the 1930s and 1940s, performed by a large ensemble including brass, woodwinds, and usually a rhythm section.",
                "Subgenres": {
                    "Progressive Big Band": {
                        "Description": "Introduces Western Classical Music compositional techniques into Big Band."
                    }
                }
            },
            "British Dance Band": {
                "Description": "Came from the dancehalls of the 1920s and 1930s, combining a British take on Jazz with the Music Hall tradition."
            },
            "Bulawayo Jazz": {
                "Description": "Emerged from the city of Bulawayo, Zimbabwe in the early 1950s, led by the alto sax and accompanied by ensembles."
            },
            "Cape Jazz": {
                "Description": "Developed parallel to American Jazz in the early 20th century, named for its origin in Cape Town, South Africa."
            },
            "Cartoon Music": {
                "Description": "Zany and uptempo; incorporated elements of Western Classical Music and Modern Classical into frantic Big Band arrangements, playfully chaotic to match the on-screen actions of cartoon characters and the beat of their movements."
            },
            "Chamber Jazz": {
                "Description": "Made by mostly small acoustic-based ensembles with emphasized improvisation and influenced by Neoclassicism and Traditional Folk Music."
            },
            "Cool Jazz": {
                "Description": "Developed in the late 1940s alongside and in response to Bebop, featuring a more restrained, emotionally 'cool' style."
            },
            "Crime Jazz": {
                "Description": "Gritty, moody style that emerged in the mid-1950s to accompany film noir movies and hard-boiled detective/crime-themed TV shows."
            },
            "Dark Jazz": {
                "Description": "Melancholic and gloomy Film noir-inspired atmosphere and influence from Crime Jazz and Dark Ambient."
            },
            "Dixieland": {
                "Description": "Developed in New Orleans in the 1910s, incorporating influences from Ragtime and Blues into cacophonous, polyphonic arrangements with instruments trading places between accompaniment and soloist."
            },
            "ECM Style Jazz": {
                "Description": "Primarily associated with ECM Records, combining elements of Jazz Fusion with the subdued atmosphere of Cool Jazz and the Western Classical Music bent of Third Stream."
            },
            "Ethio-Jazz": {
                "Description": "Unique blend of traditional Ethiopic Music and Jazz."
            },
            "Flamenco Jazz": {
                "Description": "Combination of Jazz with Flamenco nuevo, the contemporary style of Flamenco, which was pioneered in the late 1960s."
            },
            "Hard Bop": {
                "Description": "A continuation of Bebop that reintroduces more traditional African-American musical features, such as bluesy melodies, slow to medium tempos, and a more groove-oriented sound, while retaining the expressive improvisation."
            },
            "Indo Jazz": {
                "Description": "Fuses the various musical traditions of the Indian subcontinent with jazzy musical structures."
            },
            "Jazz-Funk": {
                "Description": "Jazz highly influenced by Funk."
            },
            "Jazz Fusion": {
                "Description": "Near-universal usage of electric guitars and keyboards coupled with influences from genres such as Rock, Rhythm & Blues, Funk, and Traditional Folk Music, and a relative degree of harmonic simplicity."
            },
            "Jazz manouche": {
                "Description": "Combines Jazz with several aspects of Romani Folk Music."
            },
            "Jazz Poetry": {
                "Description": "Emerged in the 1920s, incorporating the style and rhythms of Jazz as both art forms spread throughout African-American communities in the United States."
            },
            "Kréyol djaz": {
                "Description": "Combines Jazz with various styles of French Caribbean Music."
            },
            "Latin Jazz": {
                "Description": "Used originally for Afro-Cuban Jazz but, due to its evolution, is now used for the fusion of jazz with Latin American rhythms, especially genres with African origin.",
                "Subgenres": {
                    "Afro-Cuban Jazz": {
                        "Description": "Combines Jazz with the rhythm of Afro-Cuban music like Habanera."
                    }
                }
            },
            "Marabi": {
                "Description": "South African Jazz with origins in the 1920s and rooted in traditional South African music.",
                "Subgenres": {
                    "Kwela": {
                        "Description": "Influenced by Zulu music, characterized by its happy melodies, played by pennywhistle flutes and accompanied by a banjo or a guitar."
                    },
                    "Mbaqanga": {
                        "Description": "Emerged from the traditional Marabi Jazz and Swing as well as Kwela popular South African genres."
                    }
                }
            },
            "Modal Jazz": {
                "Description": "Utilizes musical modes as harmonic framework over traditionally used chord progressions.",
                "Subgenres": {
                    "Jazz Mugham": {
                        "Description": "Combines Jazz with elements of Azerbaijani Mugham, featuring jazz-inspired instrumental compositions, improvisations, wind and vocal elements, as well as modal scales and ornamentation techniques for emotional depth."
                    }
                }
            },
            "Post-Bop": {
                "Description": "Grew out of Hard Bop in the early to mid-1960s incorporating certain untraditional elements inspired largely in part from Avant-Garde Jazz, Modal Jazz and eventually, Free Jazz, such as non-diatonic chord progressions, irregular rhythms and amelodic forms."
            },
            "Samba-jazz": {
                "Description": "Jazz genre from Brazil that incorporates Samba and/or Bossa nova elements."
            },
            "Smooth Jazz": {
                "Description": "Simple melodies and slick production influenced by Pop and R&B."
            },
            "Soul Jazz": {
                "Description": "Appeared during the 1950s, when Gospel, Rhythm & Blues and later Soul started to influence the style of prolific jazz musicians."
            },
            "Spiritual Jazz": {
                "Description": "Emerged in the 1960s, marked by a mixture of Jazz with approximations of ethnic styles, religious music of non-Christian traditions, and the ecstatic, transcendental aspects of Free Jazz."
            },
            "Spy Music": {
                "Description": "Meant to evoke the action and drama of spy films."
            },
            "Stride": {
                "Description": "Early form of Ragtime-derived Jazz with improvisational tendencies; named for the performers' left hand 'striding' across the piano keyboard."
            },
            "Swing": {
                "Description": "Distinctive rhythm and large backing rhythm section over which solos are performed.",
                "Subgenres": {
                    "Swing Revival": {
                        "Description": "1990s alternative take on swing music, incorporating elements from newer genres such as Rockabilly, Ska, and Punk Rock."
                    }
                }
            },
            "Third Stream": {
                "Description": "A fusion of Jazz and Western Classical Music, with improvisation as a vital component."
            },
            "Vocal Jazz": {
                "Description": "Focused on vocals, generally using a more traditional, poppy strong structure and reducing the role of improvisation.",
                "Subgenres": {
                    "Vocalese": {
                        "Description": "Newly written lyrics set to the melody of an existing instrumental solo, often in a Bebop or Big Band style, and characterized by syllabic phrasing."
                    }
                }
            }
        }
    },
    {
        "Genre": "Metal",
        "Description": "Driving and distorted riffs, aggressive drumming, vigorous vocals, and an all-around show of brute force in its early days, since branching into dozens of subgenres.",
        "Subgenres": {
            "Alternative Metal": {
                "Description": "Mid-tempo style emphasizing melodicism and rhythmic heaviness; branches outside of the stylistic conventions of Metal.",
                "Subgenres": {
                    "Funk Metal": {
                        "Description": "Melds Funk Rock grooves with slap basslines and metallic guitarwork."
                    },
                    "Neue Deutsche Härte": {
                        "Description": "Alternative Metal and Industrial Metal that incorporates various aspects of electronic music, specifically Electronic Dance Music."
                    },
                    "Nu Metal": {
                        "Description": "Emphasizes bouncy, drop-tuned riffs, alternating vocal styles, and genre-bending, often incorporating Hip Hop and Funk Metal elements."
                    },
                    "Rap Metal": {
                        "Description": "Features rapped vocals, typically formed around heavy, mid-tempo, and groove-oriented playing in addition to elements of Hip Hop beats such as record scratching."
                    }
                }
            },
            "Avant-Garde Metal": {
                "Description": "Often breaking the bounds of the genre through experimental structures and instrumentation, or by incorporating outside influences."
            },
            "Black Metal": {
                "Description": "Typified by highly distorted, trebly, tremolo-picked guitars, blast beats, double kick drumming, shrieked vocals, and raw, underproduced sound that often favors atmosphere over technical skills and melody.",
                "Subgenres": {
                    "Atmospheric Black Metal": {
                        "Description": "Focuses on the atmospheric element using slowly developing riffs, repetitive melodies, usually slow to medium tempos, and commonly synthesized ambient textures.",
                        "Subgenres": {
                            "Blackgaze": {
                                "Description": "Melds tremolo-picked riffing, high-gain guitars, and harsh, often wailing, vocals with mellow, dreamy textures and melodic song structures."
                            }
                        }
                    },
                    "Black 'n' Roll": {
                        "Description": "Incorporates elements of Hard Rock, Glam Rock, and Heavy Metal."
                    },
                    "Black Noise": {
                        "Description": "Incorporates unconventional sounds with overpowering or constant Noise and Black Metal elements, often being heavily texture-oriented, abrasive, dissonant, atonal, or repetitive."
                    },
                    "Depressive Black Metal": {
                        "Description": "Characterized by lethargic atmospheres; usually repetitive song structures and slow-mid tempos; high-pitched wailing and gruff vocals; and usage of non-distorted instruments like keyboards and acoustic guitars."
                    },
                    "Melodic Black Metal": {
                        "Description": "Cleaner production, more diverse arrangements, and a stronger emphasis on melody than is typical for Black Metal."
                    },
                    "Pagan Black Metal": {
                        "Description": "Incorporates acoustic guitar and traditional instrument passages, cleanly sung vocals, folk songs' melodies, and paganistic themes."
                    },
                    "Symphonic Black Metal": {
                        "Description": "Symphonic soundscapes, typically but not always synthesized."
                    },
                    "War Metal": {
                        "Description": "Aggressive, chaotic, and heavily Death Metal-influenced."
                    }
                }
            },
            "Death Metal": {
                "Description": "Features distorted, commonly down-tuned guitars; palm-muted and tremolo-picked riffs; aggressive, double-kicked percussion that utilizes various blast beats techniques; abrupt changes in tempo and time signatures; and guttural vocal styles.",
                "Subgenres": {
                    "Brutal Death Metal": {
                        "Description": "Emphasizes abrasiveness, chunky rhythmic atonal riffs, and low guttural vocals.",
                        "Subgenres": {
                            "Slam Death Metal": {
                                "Description": "Focuses on slow or midtempo (as well as breakdown-style) sections built on chromatic, palm-muted riffs - so-called 'slams'."
                            }
                        }
                    },
                    "Death 'n' Roll": {
                        "Description": "Incorporates a groove-oriented, Hard Rock-influenced approach while retaining heavily distorted rhythm guitars and gruff or occasionally growled vocals."
                    },
                    "Deathgrind": {
                        "Description": "Combines the intensity and high-pitched screams of Grindcore with the technicality and low guttural vocals of Death Metal."
                    },
                    "Melodic Death Metal": {
                        "Description": "Utilizes the guitar harmonies and melodic sound of Heavy Metal, while keeping the main characteristics of Death Metal."
                    },
                    "Technical Death Metal": {
                        "Description": "Focuses on challenging, demanding songwriting and instrumental skill.",
                        "Subgenres": {
                            "Dissonant Death Metal": {
                                "Description": "Emphasizes discordant, dense songwriting and utilizes pinch harmonics, scratchy guitar leads, and atonality."
                            }
                        }
                    }
                }
            },
            "Doom Metal": {
                "Description": "Plodding tempos, repeated chords, and thick, distorted, down-tuned guitars in a style focused on foreboding, atmosphere, and tension.",
                "Subgenres": {
                    "Death Doom Metal": {
                        "Description": "Fuses down-tuned guitars, growled vocals, and aggressive, often double-kick drumming with a mournful, somber atmosphere and plodding tempos."
                    },
                    "Funeral Doom Metal": {
                        "Description": "Features exceptionally slow, funeral dirge-like tempos, heavily distorted, sluggish guitars, mournful atmosphere, and distant, hushed growls and grunts."
                    },
                    "Traditional Doom Metal": {
                        "Description": "Monotonous and heavy playing style; repetitive, rough, and sometimes atonal guitar riffs; a 'rocking to sleep' bass; and influences from both Blues Rock and Psychedelic Rock.",
                        "Subgenres": {
                            "Epic Doom Metal": {
                                "Description": "Emphasizes Heavy Metal influence and theatrical vocals."
                            }
                        }
                    }
                }
            },
            "Drone Metal": {
                "Description": "Composed with heavy repetitive drones, minimalist structure, and slow tempos."
            },
            "Folk Metal": {
                "Description": "Features influences from various types of Traditional Folk Music expressed through melodies and/or traditional instrumentation, notably having a large scene in Europe.",
                "Subgenres": {
                    "Celtic Metal": {
                        "Description": "Features Celtic Folk Music elements."
                    },
                    "Mittelalter-Metal": {
                        "Description": "Emerged as a metallic style in the mid-to-late 1990s from the German Neo-Medieval movement."
                    }
                }
            },
            "Gothic Metal": {
                "Description": "Features heavy, low-mid tempo riffs, somber, gloomy atmosphere accentuated by ethereal keyboards and synthesizer layers, and vocal styles ranging from raspy growls to female operatic singing."
            },
            "Grindcore": {
                "Description": "Features shortened song structures and a diverse palette of intense techniques such as blast and skank beats, tremolo and down-picking, and various harsh vocal styles.",
                "Subgenres": {
                    "Cybergrind": {
                        "Description": "Standard conventions of Grindcore taken to an even more discordant and rapid-fire extreme, with added Electronic dimensions of computer-generated noises and drum machines."
                    },
                    "Deathgrind": {
                        "Description": "Combines the intensity and high-pitched screams of Grindcore with the technicality and low guttural vocals of Death Metal."
                    },
                    "Goregrind": {
                        "Description": "Death Metal-influenced riffs with rhythms ranging from very fast to slower mid-tempos correlated with pitch-shifted vocals, sloppy playing and production, and gore-themed aesthetics.",
                        "Subgenres": {
                            "Gorenoise": {
                                "Description": "Combines and subverts Goregrind and Grindcore with brash Noise and even faster drum tempos."
                            },
                            "Pornogrind": {
                                "Description": "Groovy, mid-tempo style known for its exaggerated bouncy rhythm and common pornographic themes."
                            }
                        }
                    },
                    "Mincecore": {
                        "Description": "Raw and simplistic with heavy reliance on Punk structures while including political and socially aware themes."
                    },
                    "Noisegrind": {
                        "Description": "Noise-driven, defined by its rawness, feedback usage, and very brief song structures."
                    }
                }
            },
            "Groove Metal": {
                "Description": "Midtempo riffs influenced by Thrash Metal but with a greater focus on rhythmic syncopation and heaviness over speed."
            },
            "Heavy Metal": {
                "Description": "Heavier outgrowth of Hard Rock featuring greater distortion and intensity along with lesser Blues influences.",
                "Subgenres": {
                    "NWOBHM": {
                        "Description": "Acronym for new wave of British Heavy Metal, which occurred in the late 1970s, taking some influence from Punk Rock."
                    },
                    "Speed Metal": {
                        "Description": "Originating from the NWOBHM and influenced by the work of early heavy metal bands, being faster and somewhat more aggressive than heavy metal."
                    },
                    "US Power Metal": {
                        "Description": "American style influenced by NWOBHM that features heavily distorted guitars paired with more aggressive riffs, mid-tempo Heavy Metal rhythms, and over-the-top theatrical vocals with fantasy or conceptual themes."
                    }
                }
            },
            "Industrial Metal": {
                "Description": "Incorporates the abrasive and heavy sound from Industrial into a Metal context by using elements from Post-Industrial like synthesizers and drum machines.",
                "Subgenres": {
                    "Cyber Metal": {
                        "Description": "Originated around 1999, influenced by EBM and Aggrotech with more melodic and less repetitive riffs as well as harsh vocals."
                    },
                    "Neue Deutsche Härte": {
                        "Description": "Alternative Metal and Industrial Metal that incorporates various aspects of electronic music, specifically Electronic Dance Music."
                    }
                }
            },
            "Kawaii Metal": {
                "Description": "Combines a heavy and metallic style with an upbeat, J-Pop-indebted tone and vocal style; associated with a 'kawaii' aesthetic."
            },
            "Metalcore": {
                "Description": "Drop-tuned guitar riffs, constant double kick drumming with varying tempos and techniques, breakdown sections, and screaming or shouting vocals.",
                "Subgenres": {
                    "Deathcore": {
                        "Description": "Fusion genre integrating elements from Death Metal, using harsh guttural vocals, blast beats, and palm-muted or tremolo-picked riffs in conjunction with breakdowns.",
                        "Subgenres": {
                            "Downtempo Deathcore": {
                                "Description": "Slow and minimal songs emphasizing breakdowns, atmosphere, and dissonance with downtuned guitars."
                            }
                        }
                    },
                    "Mathcore": {
                        "Description": "Rhythmically complex, features unconventional time signatures, syncopated and dissonant riffs and erratic metric shifts."
                    },
                    "Melodic Metalcore": {
                        "Description": "Originated in the late 1990s when some metalcore bands infused elements of Melodic Death Metal into their sound to create a more metallic and melodic style."
                    }
                }
            },
            "Neoclassical Metal": {
                "Description": "Greatly influenced by Western Classical Music in its style of playing and composing."
            },
            "Post-Metal": {
                "Description": "Heavily utilizes timbre and texture to have enormous song build-ups and huge atmosphere.",
                "Subgenres": {
                    "Atmospheric Sludge Metal": {
                        "Description": "Combines slow, churning guitar riffs and thunderous percussion with dark, extensive otherworldly sonic landscapes."
                    },
                    "Doomgaze": {
                        "Description": "Gloomy and somber atmosphere, amplified by the slow tempo and gloominess of Doom Metal, combined with the effects, washes of sound, and vocals found within Shoegaze."
                    }
                }
            },
            "Power Metal": {
                "Description": "Developed from Heavy Metal and Speed Metal; characterized by its emphasis on speed, vocal melody and harmonized lead guitars."
            },
            "Progressive Metal": {
                "Description": "Fuses amplified, guitar-driven sound with technical proficiency, virtuosity, complex compositions, innovative arrangements, eclecticism, and additional instrumentation.",
                "Subgenres": {
                    "Djent": {
                        "Description": "Syncopated rhythmic structures, angular melodies, and dissonant chords."
                    }
                }
            },
            "Sludge Metal": {
                "Description": "Combines the slow, dark instrumentals and atmosphere of Doom Metal with the aggressive, harsh screams and shouts credited to Hardcore Punk.",
                "Subgenres": {
                    "Atmospheric Sludge Metal": {
                        "Description": "Combines slow, churning guitar riffs and thunderous percussion with dark, extensive otherworldly sonic landscapes."
                    }
                }
            },
            "Southern Metal": {
                "Description": "Blues-influenced style that primarily incorporates Sludge Metal and Stoner Metal with metallic Southern Rock riffs."
            },
            "Stenchcore": {
                "Description": "Heavier, more metallic form of Crust Punk drawing influence from Thrash Metal as well as Death Metal and Heavy Metal."
            },
            "Stoner Metal": {
                "Description": "Combines elements of Doom Metal with elements of Psychedelic Rock and Blues Rock to create a melodic yet heavy sound."
            },
            "Symphonic Metal": {
                "Description": "Elements of symphonic and orchestral music."
            },
            "Thrash Metal": {
                "Description": "Features fast tempos; rhythmically focused, frequently palm-muted riffs; shredding solos; aggressive, often double-kicked drumming; skank beats; and vocal styles ranging from shouts to melodic singing.",
                "Subgenres": {
                    "Crossover Thrash": {
                        "Description": "Fusion of Thrash Metal and Hardcore Punk which started in the 1980s."
                    },
                    "Technical Thrash Metal": {
                        "Description": "Places great emphasis on complex songwriting and demanding instrumental parts."
                    }
                }
            },
            "Trance Metal": {
                "Description": "Tempo between 130 and 160 BPM, played with keyboards and metal instrumentation, sung with harsh and aggressive vocals including many clean melodic styles; regularly uses elements of Melodic Death Metal, Symphonic Metal, and Electronic Dance Music."
            },
            "Viking Metal": {
                "Description": "Developed out of Black Metal and embodies an epic, Viking-like aesthetic."
            }
        }
    },
    {
        "Genre": "Musical Theater and Entertainment",
        "Description": "Range of styles of theatre individually popular in the United States or in various countries in Europe, mostly from the 19th century to the mid-20th century.",
        "Subgenres": {
            "Ballad Opera": {
                "Description": "English reaction to the Italian Opera styles with a satirical sense of humor and scores borrowing from Traditional Folk Music and popular music."
            },
            "Cabaret": {
                "Description": "Entertainment featuring Comedy, song, dance, and theatre."
            },
            "Comédie-ballet": {
                "Description": "French form of musical drama from the 17th century that combines operatic singing, classical dance, and theater."
            },
            "Cuplé": {
                "Description": "Originally developed in the 19th century as a blend of old theatre Spanish styles based in short monologues (jácara and tonadilla) and French Couplet."
            },
            "Dutch Cabaret": {
                "Description": "Popular comedy form in the Netherlands which evolved out of traditional Cabaret in the 1890s."
            },
            "Kabarett": {
                "Description": "Theatrical entertainment consisting of mixed elements of music, sketches, monologues, dialogues, lyric poetry and/or ballads."
            },
            "Kanto": {
                "Description": "Songs performed at the Tuluat Theaters of İstanbul in the late 19th century."
            },
            "Minstrelsy": {
                "Description": "Popular song and entertainment tradition from the U.S. engendered in variety shows employing racist caricature and blackface."
            },
            "Murga": {
                "Description": "Popular carnival music traditional in some cities of Spain and Hispanic America.",
                "Subgenres": {
                    "Murga uruguaya": {
                        "Description": "Variant originated in Montevideo that stands out for its rhythms, nasal vocals and choral arrangements."
                    }
                }
            },
            "Music Hall": {
                "Description": "British theatrical entertainment popular in the 19th and 20th centuries, featuring light and comedic popular songs."
            },
            "Operetta": {
                "Description": "Light opera interspersed with spoken dialogues, being usually satirical and/or humorous in nature and centered around romantic plots and dancing scenes.",
                "Subgenres": {
                    "Kalon'ny fahiny": {
                        "Description": "Fusion of music from the highlands of Madagascar and western Operetta."
                    }
                }
            },
            "Revue": {
                "Description": "French Musical Theatre and Entertainment based on numbers and sketches inspired by the most relevant events of the year."
            },
            "Rock Musical": {
                "Description": "Style of musical theatre inspired by Rock."
            },
            "Show Tunes": {
                "Description": "Originally composed to forward the story or enhance the characters or other plot elements of Broadway productions and other stage music."
            },
            "Siffleur": {
                "Description": "Professional whistlers on the Vaudeville and Music Hall circuits."
            },
            "Singspiel": {
                "Description": "German form of Opera distinguished by the prominent usage of spoken dialogues mixed with lyrical or folklore arias/ballads."
            },
            "Vaudeville": {
                "Description": "Performed in American musical theaters typically as part of a lowbrow, often comedic variety performance.",
                "Subgenres": {
                    "Vaudeville Blues": {
                        "Description": "Vaudeville incorporating heavy Blues elements."
                    }
                }
            }
        }
    },
    {
        "Genre": "New Age",
        "Description": "Broad genre centered on peaceful, meditative melodies, using a wide variety of instrumentation.",
        "Subgenres": {
            "Andean New Age": {
                "Description": "Takes heavy influence from Indigenous Andean Music, emphasizing a peaceful and harmonious atmosphere and often using the flute."
            },
            "Celtic New Age": {
                "Description": "Represented in its most known style by a mysterious blend of subliminal sounds, ambient beats, and angelic and ethereal female vocals."
            },
            "Native American New Age": {
                "Description": "Takes heavy influence from Indigenous North American Music, emphasizing a peaceful and harmonious atmosphere and utilizing chants, drumming, and flutes."
            },
            "Neoclassical New Age": {
                "Description": "Strongly influenced by and sometimes also based upon early music and the Baroque Music or Classical Period."
            },
            "New Age Kirtan": {
                "Description": "American development of Kirtan, fusing it with New Age and Western music."
            },
            "Tibetan New Age": {
                "Description": "Incorporates perceived elements of Tibetan Music, particularly singing bowls."
            }
        }
    },
    {
        "Genre": "Pop",
        "Description": "Umbrella of popular styles closely tied to mass production and mass marketing, focusing on catchiness and accessibility through melody, rhythm, lyrics, and hooks.",
        "Subgenres": {
            "Adult Contemporary": {
                "Description": "Slow to midtempo with a light and soothing tone, emerged as a successful radio format in the late 1970s and early 1980s."
            },
            "Afrobeats": {
                "Description": "Originated in West Africa during the early 2010s and includes elements from Pop Rap, Contemporary R&B, and Dancehall.",
                "Subgenres": {
                    "Afropiano": {
                        "Description": "Blends the easy-going, poppy, and melodic Afrobeats sound and rhythms with major Amapiano elements, like lush, jazzy, and laid-back atmospheres often featuring light piano chords."
                    },
                    "Alté": {
                        "Description": "More subdued, atmospheric, minimalist, and eclectic production and vocal styles compared to earlier styles, as well as more socially conscious lyrics."
                    }
                }
            },
            "Alt-Pop": {
                "Description": "Emerged in the late 2000s and early 2010s, combines chart Pop conventions with alternative/indie genre sensibilities sometimes on a more minimal and contemplative atmosphere, often extracted from Alternative R&B."
            },
            "Arabic Pop": {
                "Description": "Synthesis of Arabic Music with Western Pop melodies, almost always sung in Arabic and typically performed with Arabic instruments, alongside some Western instruments like the guitar.",
                "Subgenres": {
                    "Al jeel": {
                        "Description": "Emerged in the 1970s as an alternative to Shaabi, taking influence from foreign Pop and incorporating rhythms of Reggae while retaining a distinctly Egyptian sound."
                    }
                }
            },
            "Art Pop": {
                "Description": "Artistic, inventive and singular presentation and performance, often featuring poetic or oblique lyricism, and frequently subverting and experimenting with various other genres and art forms while remaining fairly Pop-oriented and accessible."
            },
            "Balkan Pop-Folk": {
                "Description": "Balkan popular music which blends Pop, Folk, and ethnic music.",
                "Subgenres": {
                    "Chalga": {
                        "Description": "Bulgarian blend of Contemporary Folk (Turkish, Bulgarian, Arabic & Romani) with Dance-Pop."
                    },
                    "Manele": {
                        "Description": "Mixture of Romanian Music with Turkish, Middle Eastern, Balkan, and Romani influences, usually electronic in production."
                    },
                    "Modern Laika": {
                        "Description": "Laiki music mixed with popular Western music, most notably pop and dance."
                    },
                    "Musika popullore": {
                        "Description": "Tradition in Albania consisting of light, commercial, amplified Albanian Folk Music usually professionally arranged and manufactured in recording studios alongside video clips."
                    },
                    "Muzică de mahala": {
                        "Description": "Appeared in the 1980s, incorporating modern instruments and based on the model of Balkan Pop-Folk in neighboring countries."
                    },
                    "Skiladika": {
                        "Description": "Greek popular artists who used more Arabian elements; originally a derogatory term used to refer to a more decadent side of Laika."
                    },
                    "Tallava": {
                        "Description": "Mixture of Romani, Greek, Turkish, Albanian, and Slavic music, which incorporates Dance-Pop elements, and is very popular in Albania and Kosovo."
                    },
                    "Turbo-Folk": {
                        "Description": "Originated in Serbia during the 1980s, fusing traditional Western Balkan Folk Music with elements of contemporary popular music."
                    }
                }
            },
            "Baroque Pop": {
                "Description": "Incorporates elements of Western Classical Music, commonly featuring harpsichord or strings as well as the rhythmic flow and counterpoint of Baroque Music."
            },
            "Bitpop": {
                "Description": "Fuses Bit Music with additional synths, beats, guitars and modern production values, emphasizing highly catchy melodies and relatively fast tempos."
            },
            "Blue-Eyed Soul": {
                "Description": "Usually refers to a Pop or Pop Rock song that contains strong Gospel-like elements, primarily popularized by white American and British singers in the 1960s through the 1980s."
            },
            "Boy Band": {
                "Description": "Male vocal groups often put together by talent managers or record producers."
            },
            "Brega calypso": {
                "Description": "Romantic vocals and lyrics, bubbly and sensual melodies and rhythms, horn sections and lush Caribbean-like guitar riffs over fast tempos."
            },
            "Brill Building": {
                "Description": "Elaborate, polished, and typically melodramatic composition and arrangement associated with the songwriting teams at the Brill office building during the late 1950s and early 1960s."
            },
            "Bubblegum": {
                "Description": "Upbeat, catchy, simple, and targeted at children and young teens; especially popular in the 1960s and 1970s."
            },
            "Cambodian Pop": {
                "Description": "Popular music produced in Cambodia or by Khmer people.",
                "Subgenres": {
                    "Rom kbach": {
                        "Description": "Cambodian pop with a slow melody that is similar to Luk thung."
                    }
                }
            },
            "Canción melódica": {
                "Description": "Sentimental vocal music sung in Spanish with a focus on the chorus, originally developed in the first half of the 20th century from a variety of traditional Hispanic genres.",
                "Subgenres": {
                    "Bolero-Beat": {
                        "Description": "Latin American style stemming from both Canción melódica and the British Beat Music."
                    },
                    "Música cebolla": {
                        "Description": "Chilean offshoot of Canción melódica that expresses a much more melancholic or nostalgic side."
                    }
                }
            },
            "CCM": {
                "Description": "Popular music focused on Christian spirituality and faith.",
                "Subgenres": {
                    "Praise & Worship": {
                        "Description": "Christian music with lyrics focused on the greatness of God."
                    }
                }
            },
            "City Pop": {
                "Description": "Wave of Japanese Pop intended to reflect urban life during the period of the country's booming economy in the 1970s and 1980s, featuring a contemporary Western sound and lush arrangements."
            },
            "Classical Crossover": {
                "Description": "Takes specific Western Classical Music conventions and applies them into a straightforward Pop context for mainstream appeal."
            },
            "Country Pop": {
                "Description": "Combination of Country with Pop to appeal to a larger audience.",
                "Subgenres": {
                    "Bro-Country": {
                        "Description": "21st century style with an often party-oriented sound and lyrical content, taking strong influence from Hip Hop & Pop."
                    },
                    "Countrypolitan": {
                        "Description": "Emphasizes Pop-oriented orchestration and songwriting while reducing the role of Country instrumentation and rhythms; often featuring lush string arrangements and group backing vocals."
                    },
                    "Urban Cowboy": {
                        "Description": "Melds country and Pop (best described as 70s L.A. soft pop), and sometimes leans towards Disco."
                    }
                }
            },
            "C-Pop": {
                "Description": "Commercialized pop performed by Chinese communities across China and Taiwan, alongside its large diaspora.",
                "Subgenres": {
                    "Cantopop": {
                        "Description": "Cantonese-language Pop with its heyday in the 1980s and early 1990s."
                    },
                    "Mandopop": {
                        "Description": "C-Pop in which songs are performed in Mandarin."
                    },
                    "Zhongguo feng": {
                        "Description": "Inspired by traditional elements of Chinese Music with lyrical themes constantly revolving around Chinese culture and tales."
                    }
                }
            },
            "Dance-Pop": {
                "Description": "Simple, yet catchy melodies and throbbing beats inspired initially by Disco and later various House styles.",
                "Subgenres": {
                    "Bubblegum Dance": {
                        "Description": "Playful, childlike style with a Bubblegum-like atmosphere that often incorporates high-pitched, light-hearted, and usually female-fronted vocals."
                    },
                    "Disco polo": {
                        "Description": "Polish Dance-Pop, originally established from contemporary wedding / feast songs and Italo-Disco."
                    },
                    "Freestyle": {
                        "Description": "Electro-influenced; developed in Latino communities in New York and Miami in the 1980s, especially dominated by Latin Freestyle and its Latin influences.",
                        "Subgenres": {
                            "Latin Freestyle": {
                                "Description": "Displays a heavy influence of Hispanic American Music alongside the Disco, Hip Hop, and Electro influences of Freestyle."
                            }
                        }
                    },
                    "Funk melody": {
                        "Description": "Light and melodic take on Funk brasileiro, developed alongside Funk carioca."
                    },
                    "Romanian Popcorn": {
                        "Description": "Emerged in the second half of the 2000s in Romania, often featuring brass melodies and 'staccato' pluck grooves."
                    },
                    "Tecnorumba": {
                        "Description": "Blend of the themes and singing style of Rumba flamenca with the most commercial forms of House, Techno, and Makina."
                    },
                    "Township Bubblegum": {
                        "Description": "Synth-heavy Dance-Pop style popular in the South African townships in the 1980s and early 1990s."
                    }
                }
            },
            "Dangdut": {
                "Description": "Indonesian popular music distinguished by a rhythmic blend of Indian, Arabic, Western, Malay, Sundanese, and Javanese influences within Indonesian Music, characterized by a unique rhythmic pattern from kendang.",
                "Subgenres": {
                    "Dangdut koplo": {
                        "Description": "Development of Javanese Dangdut which originated in Indonesia in the 1990s, featuring a faster tempo and influences from international styles like Pop, Rock, and Reggae."
                    }
                }
            },
            "Dansbandsmusik": {
                "Description": "Nordic Pop style originating from 1960s Pop Rock, incorporating Swing, Schlager, Nordic Old Time Dance Music and Country influences."
            },
            "Dansktop": {
                "Description": "Danish equivalent to Dansbandsmusik with Schlager and Country influences and Contemporary Folk and Pop elements."
            },
            "Denpa": {
                "Description": "Underground Japanese Pop aiming to be bizarre yet catchy, using off-key vocals, strange or nonsensical lyrics, repetitive chants, onomatopoeia, frantic, 'off-kilter' production, and 'moe' vocals and aesthetics."
            },
            "Electropop": {
                "Description": "Dense, layered, and compressed production, usually coupled with a distinct fuzzy and 'warm' low-frequency synthesizer style."
            },
            "Europop": {
                "Description": "Emerged throughout mainland Europe in the early 1970s, referring to slick, highly commercial Pop songs that emphasize sugary melodies and light, bouncy instrumentation."
            },
            "Flamenco Pop": {
                "Description": "Originally developed in the mid 1960s, incorporated palos flamencos (Flamenco subgenres) and Copla into the format of feisty and lively Pop (particularly, Yé-yé)."
            },
            "Folk Pop": {
                "Description": "Blends Contemporary Folk with a Pop sensibility, most popular in the late 1960s and early 1970s and featuring influence from the contemporary Folk Rock style.",
                "Subgenres": {
                    "Stomp and Holler": {
                        "Description": "Highlights driving 'stomping' rhythms and shouted group vocal harmonies, often drawing influences from Pop Rock, Indie Folk, and other genres, while maintaining a characteristically mellow and commercial sound."
                    }
                }
            },
            "French Pop": {
                "Description": "Pop originating from France."
            },
            "Girl Group": {
                "Description": "Combines elements of Rhythm & Blues, Rock & Roll, and Traditional Pop; typically performed by trios or quartets of female vocalists."
            },
            "Glitch Pop": {
                "Description": "Incorporates elements of more experimental Electronic styles like IDM and Glitch."
            },
            "Hyperpop": {
                "Description": "Developed and took inspiration from Bubblegum Bass and popular 2000s-2010s Electropop, characterized by eclectic, unconventional, mechanical-sounding and dense production; and by manipulated, usually auto-tuned vocals."
            },
            "Indian Pop": {
                "Description": "Commonly based out of India, Pakistan and Bangladesh and almost always sung in Hindi, Urdu or Bengali, implements South Asian Music in context of American and European Pop and Rock music."
            },
            "Indie Pop": {
                "Description": "Back-to-basics Rock approach combining a less mainstream and DIY ethos with melodic, lighthearted and straightforward songwriting.",
                "Subgenres": {
                    "Bedroom Pop": {
                        "Description": "Named for solo producers and singer-songwriters from the 2010s onward who created intimate, 'authentic' music in their own homes, outside of a traditional studio environment."
                    },
                    "C86": {
                        "Description": "Distinctly ramshackle, often Twee Pop-infused combination of British Indie Rock and Jangle Pop."
                    },
                    "Chamber Pop": {
                        "Description": "Based on the smooth and melodic songwriting of Lounge and other Easy Listening, as well as the orchestration of Baroque Pop and the production styles of other 1960s pop genres."
                    },
                    "Neo-Acoustic": {
                        "Description": "Japanese term for a cross-section of Indie Pop and Jangle Pop with more prominent acoustic instrumentation and songwriting/arrangements that draw from Sophisti-Pop."
                    },
                    "Sonido Donosti": {
                        "Description": "Sentimental and melancholic scene, influenced by Twee Pop, that emerged in the late 1980s in Donostia / San Sebastián, Spain."
                    },
                    "Tontipop": {
                        "Description": "Spanish scene known for its exuberant, child-like sound drawing directly from British Twee Pop, as well as Yé-yé, Bubblegum, and Synthpop."
                    },
                    "Twee Pop": {
                        "Description": "Distinct Post-Punk background and often jangling guitars, defined by a cute aesthetic and lyrics combined with an indie/DIY attitude and a simplicity often indebted to Punk Rock."
                    }
                }
            },
            "Irish Showband": {
                "Description": "Phenomenon lasting from the mid-1950s until the early 1980s, often performed a mixture of currently popular music and skits."
            },
            "Italo Pop": {
                "Description": "Romantic style developed in Italy in the late 1950s including various influences such as Chanson and Schlager.",
                "Subgenres": {
                    "Canzone neomelodica": {
                        "Description": "Elements are derived from Canzone napoletana."
                    }
                }
            },
            "Jazz Pop": {
                "Description": "Pop that incorporates elements from Jazz."
            },
            "J-Pop": {
                "Description": "Commercial Pop of Japan after the advent of the Heisei era (1989), characterized by modernized production, a more eclectic sound palette, and a more westernized vocal style.",
                "Subgenres": {
                    "Akishibu-kei": {
                        "Description": "Otaku inclined update of the style pioneered by the Shibuya-kei scene, mixed with J-Pop and often tied to Anime and video game music."
                    },
                    "Yakousei": {
                        "Description": "Eclectic scene from Japan popularized in the late 2010s; characterized by Dance-influenced rhythms, Indie Pop and Indie Rock's approaches to composition and a focus on vocal delivery and introspective lyricism."
                    }
                }
            },
            "Kayōkyoku": {
                "Description": "Japanese popular music prominent during the later period of the Shōwa era (early 1950s to late 1980s).",
                "Subgenres": {
                    "Idol kayō": {
                        "Description": "More Westernized and upbeat form of Kayōkyoku popular in the 1970s and 1980s which acted as a precursor to J-Pop."
                    },
                    "Mood kayō": {
                        "Description": "Early form of Kayōkyoku dominant in the 1950s and 1960s, prominently influenced by American Jazz, Hispanic American Music, and Hawaiian Music."
                    },
                    "Techno kayō": {
                        "Description": "Offshoot of 1980s Kayōkyoku and Idol kayō incorporating characteristics from Synthpop."
                    }
                }
            },
            "Korean Ballad": {
                "Description": "South Korean Pop from the 1980s to the early 90s taking influence from western Blues, Synthpop, Soul and Contemporary Folk.",
                "Subgenres": {
                    "Oriental Ballad": {
                        "Description": "Emerged in the late 1990s in South Korea, taking influence from more traditional forms of Korean Music."
                    }
                }
            },
            "K-Pop": {
                "Description": "Contemporary Pop scene in South Korea based on multiple mainstream influences such as Contemporary R&B, Dance-Pop, and Hip Hop.",
                "Subgenres": {
                    "Semi-Trot": {
                        "Description": "Contemporary form of Trot which takes influences from modern K-Pop and recent Pop substyles."
                    }
                }
            },
            "Latin Pop": {
                "Description": "Characterized by its usage of Latino clichés and frequently influenced by traditional Latin American styles, commonly borrowing from their instrumentation.",
                "Subgenres": {
                    "Cumbia pop": {
                        "Description": "Developed in the Río de la Plata region in the mid-2010s, featuring Latin Pop influences and lyrics related to romance, youth, and fun."
                    },
                    "Tropipop": {
                        "Description": "Subgenre of Colombian origin fusing Vallenato instrumentation into a Latin Pop context."
                    }
                }
            },
            "Lokal musik": {
                "Description": "Created by local, rural artists from Papua New Guinea that incorporate some elements of Papuan Folk Music into Pop."
            },
            "Mulatós": {
                "Description": "Upbeat, danceable Hungarian Pop that takes strong influence from Hungarian Folk Music and Romani Folk Music."
            },
            "Nederpop": {
                "Description": "Dutch language Pop which originally arose in the 1970s to describe the style of the 1950s and 1960s, but would also later be used for 1980s artists who incorporated elements of Ska and Reggae.",
                "Subgenres": {
                    "Palingsound": {
                        "Description": "Originating from Volendam in the Netherlands; harmonizing vocals and orchestrated arrangements."
                    }
                }
            },
            "New Music": {
                "Description": "Developed when Japanese Singer-Songwriters incorporated elements of Contemporary Folk and Pop Rock with Kayōkyoku songwriting."
            },
            "New Romantic": {
                "Description": "UK pop cultural movement associated with the early 1980s and defined by a distinct, flamboyant fashion sense."
            },
            "OPM": {
                "Description": "Style of pop balladry originating from the Philippines as a successor of the Manila Sound."
            },
            "Orthodox Pop": {
                "Description": "Combines Orthodox Jewish themes and prayer with Pop songwriting, usually sung in Hebrew."
            },
            "Persian Pop": {
                "Description": "Hybrid of Iranian and Persian-language popular music with Western instruments such as the guitar, drum kit, and synthesizer."
            },
            "Pop Batak": {
                "Description": "Combines Western genres of music and instrumentation with a typical Batak flair, like lyrics about Batak life and the use of some traditional Batak instruments."
            },
            "Pop Ghazal": {
                "Description": "Employs traditional Ghazal's verse, meter, and poetic inclinations in a pop form."
            },
            "Pop Minang": {
                "Description": "Combines Minangkabau traditions with Pop structures and instrumentation."
            },
            "Pop Raï": {
                "Description": "Fuses melodic sensibilities into the traditional Raï structure, with increased utilization of synthesizers, guitars, and drum machines."
            },
            "Pop Reggae": {
                "Description": "Light, commercial form of Reggae designed to crossover and break through to a more mainstream Pop audience."
            },
            "Pop Rock": {
                "Description": "Standard verse-chorus Pop that can also be categorized under Rock for its use of guitars, drums, and propulsive rhythms.",
                "Subgenres": {
                    "Beat Music": {
                        "Description": "Emerged in the early 1960s in the United Kingdom, drawing on Rock & Roll and the late 1950s Skiffle revival.",
                        "Subgenres": {
                            "Freakbeat": {
                                "Description": "Combined elements of British Rhythm & Blues, Beat Music, and Pop Rock with the studio effects of Psychedelia - fuzztones, flanging, chorus - to create a style often seen as a British relative of American Garage Rock and Psychedelic Rock."
                            },
                            "Group Sounds": {
                                "Description": "Japanese bands in the mid-to-late 1960s who began performing a style of Beat Music primarily in English."
                            },
                            "Jovem Guarda": {
                                "Description": "1960s Brazilian youth-oriented Pop Rock, with romantic lyrics and influenced by Merseybeat and Rockabilly."
                            },
                            "Merseybeat": {
                                "Description": "Light, highly melodic style of Beat Music popular in the UK during the early 1960s, named due to the abundance of bands from Liverpool beside the River Mersey."
                            },
                            "Nederbeat": {
                                "Description": "Dutch answer to the UK Beat Music boom of the 1960s."
                            }
                        }
                    },
                    "Big Music": {
                        "Description": "Rooted in Post-Punk and popular in the 1980s, with anthemic songwriting and a grandiose, stadium-ready sound."
                    },
                    "Britpop": {
                        "Description": "Emerged in the United Kingdom in the early 1990s, with a style hearkening back to the traditional guitar-driven songs and melodic hooks found in the British Pop Rock of the 1960s."
                    },
                    "Jangle Pop": {
                        "Description": "Pop-oriented songwriting based around chiming jangly guitar lines, and propulsive rhythms often drawn from Post-Punk.",
                        "Subgenres": {
                            "C86": {
                                "Description": "Distinctly ramshackle, often Twee Pop-infused combination of British Indie Rock and Jangle Pop."
                            },
                            "Neo-Acoustic": {
                                "Description": "Japanese term for a cross-section of Indie Pop and Jangle Pop with more prominent acoustic instrumentation and songwriting/arrangements that draw from Sophisti-Pop."
                            },
                            "Paisley Underground": {
                                "Description": "Emerged in Los Angeles in the early 1980s, featuring the energy of Power Pop and New Wave adorned with retro Psychedelia."
                            }
                        }
                    },
                    "Manila Sound": {
                        "Description": "Philippine Pop Rock movement most prominent in the 1970s; served as a predecessor of OPM."
                    },
                    "Piano Rock": {
                        "Description": "Primarily based around piano riffs and melodies, rather than having guitar as the focal instrument."
                    },
                    "Post-Britpop": {
                        "Description": "Emerged in the late 1990s as a Britpop expansion mainly characterized by acoustic-leaning instrumentation, lush string arrangements, and mid-tempo song structures, as well as less apparent lyrical concerns for Britain in favor of introspective, contemplative themes."
                    },
                    "Power Pop": {
                        "Description": "Heavier Pop Rock that combines strong Pop melodies with loud power chords, characterized by prominent electric guitars, clear vocals, crisp harmonies, and economical arrangements."
                    },
                    "Soft Rock": {
                        "Description": "Light, melodic, radio-friendly Rock which gained huge commercial success in the 1970s.",
                        "Subgenres": {
                            "Tropical Rock": {
                                "Description": "Combines influences from Country Rock and Caribbean Music to create an acoustic and breezy 'island' themed sound."
                            },
                            "Yacht Rock": {
                                "Description": "Slick Pop Rock influenced by smoother R&B styles, popular in the late 1970s and often associated with California."
                            }
                        }
                    },
                    "Sonido Donosti": {
                        "Description": "Sentimental and melancholic scene, influenced by Twee Pop, that emerged in the late 1980s in Donostia / San Sebastián, Spain."
                    },
                    "Stereo": {
                        "Description": "Burmese Pop Rock genre which emerged in the mid-1960s."
                    },
                    "Twee Pop": {
                        "Description": "Distinct Post-Punk background and often jangling guitars, defined by a cute aesthetic and lyrics combined with an indie/DIY attitude and a simplicity often indebted to Punk Rock."
                    },
                    "Vocal Surf": {
                        "Description": "Appropriates the sounds of instrumental Surf Rock, combining surfing- and car-themed lyrics with a style that draws primarily from Doo-Wop and Rock & Roll."
                    }
                }
            },
            "Pop Soul": {
                "Description": "Fusion of Pop and Soul; originated in the 1960s as an attempt to give soul crossover success.",
                "Subgenres": {
                    "Motown Sound": {
                        "Description": "Succinct, catchy song structures; complex arrangements; Gospel-influenced vocals; highly melodic and rhythmic bass lines; 4-4 drum patterns; often syncopated piano parts; regular use of horn and string sections; and historically a distinctive reverb and treble-heavy production."
                    }
                }
            },
            "Pop Sunda": {
                "Description": "Mixes Sundanese traditions with Pop structures and instrumentation."
            },
            "Progressive Pop": {
                "Description": "Milder counterpart to Progressive Rock, emerging in the late 1960s and introducing complex songwriting and arrangements into a Pop context."
            },
            "Psychedelic Pop": {
                "Description": "Combines unconventional instrumentation with studio effects to create a psychedelic atmosphere within melodic Pop music."
            },
            "Rabiz": {
                "Description": "Elements of Armenian folk in its instrumentation, oftentimes incorporating influences from Arabic and other West Asian forms on a background of synthesizer arrangements."
            },
            "Rigsar": {
                "Description": "Dominant form of popular music in Bhutan which broke traditions to move towards a more Western and Indian approach."
            },
            "Rumba catalana": {
                "Description": "Cheerful Catalan genre that takes influences from Rumba cubana, Andalusian Rumba flamenca, and Pop."
            },
            "Russian Chanson": {
                "Description": "Divided into lyrical and criminal chanson, it is best described as narrative-driven popular music inspired by crime and prison."
            },
            "Schlager": {
                "Description": "Light, sentimental, melodic pop music common mainly in northern and central Europe.",
                "Subgenres": {
                    "Humppa": {
                        "Description": "Finnish music related to Jazz and the foxtrot."
                    },
                    "Levenslied": {
                        "Description": "Dutch genre that enjoyed widespread popularity in the pre-Rock & Roll era. with simple melody and rhythm and lyrics composed of couplets and refrains."
                    },
                    "Volkstümliche Musik": {
                        "Description": "Light Pop with borrowings from German Folk Music (volksmusik), often misleadingly labeled as being volksmusik."
                    }
                }
            },
            "Sertanejo romântico": {
                "Description": "Hybrid of Brazilian Sertanejo with Pop production and aesthetics, made popular nationwide during the mid-to-late 1980s.",
                "Subgenres": {
                    "Sertanejo universitário": {
                        "Description": "Third evolution of Sertanejo, sharing close sensibilities with national Brazilian Pop music and other regional styles."
                    },
                    "Arrocha sertanejo": {
                        "Description": "Merged the Arrocha style with the younger audience creating a more energetic and more danceable rhythm."
                    },
                    "Funknejo": {
                        "Description": "Incorporates the rhythms, production, and idioms of Funk brasileiro into the universitário genre."
                    }
                }
            },
            "Sophisti-Pop": {
                "Description": "Incorporates influences from Jazz, classic R&B and Soul along with a slick, polished production style while retaining elements from its New Wave roots."
            },
            "Soviet Estrada": {
                "Description": "Emerged in the USSR during the early 1930s, and encompassed the dominating popular music style composed by government-approved songwriters and the primary repertoire of professionally trained performers."
            },
            "Sunshine Pop": {
                "Description": "Retrospective term for a more cheerful or wistful style of Pop which emerged in the mid-1960s as 'soft pop'."
            },
            "Synthpop": {
                "Description": "Led by a prominent, melodic synthesizer sound, often with reverberated drum machine patterns that create a distinct atmospheric feel commonly associated with the 1980s.",
                "Subgenres": {
                    "Futurepop": {
                        "Description": "Derivative of EBM, retaining its apocalyptic worldview but incorporating heavy influence from the melodic style of Synthpop."
                    },
                    "Pon-chak disco": {
                        "Description": "Heavily influenced by Electro-Disco, featuring cheap 'electronic organ' synth leads and minimalistic, repetitive rhythms."
                    },
                    "Techno kayō": {
                        "Description": "Offshoot of 1980s Kayōkyoku and Idol kayō incorporating characteristics from Synthpop."
                    }
                }
            },
            "Teen Pop": {
                "Description": "Oriented to teen audiences and almost always sung by teens."
            },
            "Traditional Pop": {
                "Description": "Predominant form of Western commercial popular music in the pre-Rock & Roll era, particularly in the USA and starting with Tin Pan Alley; typically vocal-oriented with an orchestral arrangement.",
                "Subgenres": {
                    "British Dance Band": {
                        "Description": "Came from the dancehalls of the 1920s and 1930s, combining a British take on Jazz with the Music Hall tradition."
                    },
                    "Mood kayō": {
                        "Description": "Early form of Kayōkyoku dominant in the 1950s and 1960s, prominently influenced by American Jazz, Hispanic American Music, and Hawaiian Music."
                    },
                    "Romanţe": {
                        "Description": "Expressive and poetic Romanian style, generally sung similar to a Chanson and composed for piano and guitar orchestral arrangements."
                    },
                    "Standards": {
                        "Description": "Traditional compositions originating from the 1910s and onward which have become widely known, performed, and recorded across the world."
                    },
                    "Tin Pan Alley": {
                        "Description": "Early era of popular song in the USA, broadly from the 1890s-1930s; influences include Ragtime, Vaudeville, and Parlour Music."
                    }
                }
            },
            "Turkish Pop": {
                "Description": "Started in the late 1950s, when Turkish artists started to write their own lyrics to Western popular tunes."
            },
            "Vocal Trance": {
                "Description": "Melodic, polished, Pop-like, and vocal-focused with around 120-145 BPM and frequent overlap with Progressive Trance, Uplifting Trance, and Euro-Trance."
            },
            "V-Pop": {
                "Description": "Western-sounding pop with Vietnamese lyrics, or pop that borrows sounds from popular Vietnamese genres and re-imagines them with more accessible and/or upbeat structures."
            },
            "Yé-yé": {
                "Description": "Upbeat, trendy Pop that emerged in Southern Europe in the early 1960s, focusing on image and risqué lyrics."
            }
        }
    },
    {
        "Genre": "Psychedelia",
        "Description": "Umbrella of styles intended to replicate or enhance the altered state of consciousness brought on by the use of psychedelic drugs, originating in the 1960s.",
        "Subgenres": {
            "Neo-Psychedelia": {
                "Description": "Developments in Psychedelia since the early 1980s, building on the drug-inspired styles developed in the 1960s.",
                "Subgenres": {
                    "Hypnagogic Pop": {
                        "Description": "Originating among 2000s underground artists referencing the sounds of 1970/1980s pop culture through hazy, low-fidelity production."
                    },
                    "Paisley Underground": {
                        "Description": "Emerged in Los Angeles in the early 1980s, featuring the energy of Power Pop and New Wave adorned with retro Psychedelia."
                    },
                    "Psichedelia occulta italiana": {
                        "Description": "Extracts elements of texture-based Rock and other texture-based music into a brooding, mysterious, subtly malignant atmosphere reminiscent of the collective memory and popular media of Italy."
                    },
                    "Space Rock Revival": {
                        "Description": "Type of Neo-Psychedelia that draws from the aesthetics and expansive sonic palette of Space Rock combined with the more minimal, back-to-basics approach of the Post-Punk era."
                    }
                }
            },
            "Psychedelic Folk": {
                "Description": "Acoustic forms that capture an atmosphere that is at turns dream-like, 'spaced-out', whimsical, haunting, mystical, and melancholic.",
                "Subgenres": {
                    "Freak Folk": {
                        "Description": "Offshoot of the New Weird America movement characterised by acoustic and eclectic instruments, peculiar vocal styles, romantic lyrics, and a childlike atmosphere."
                    },
                    "Free Folk": {
                        "Description": "Incorporates improvisation, repetition and extended song lengths."
                    },
                    "Udigrudi": {
                        "Description": "Movement that emerged in the Brazilian city of Recife during the 1970s that combines psychedelic elements with music of Northeastern Brazil."
                    }
                }
            },
            "Psychedelic Pop": {
                "Description": "Combines unconventional instrumentation with studio effects to create a psychedelic atmosphere within melodic Pop music."
            },
            "Psychedelic Rock": {
                "Description": "Rock which emerged in the mid-1960s that often attempts to emulate or enhance the effects of psychedelic drugs.",
                "Subgenres": {
                    "Acid Rock": {
                        "Description": "Heavier with an emphasis on instrumental jamming and 'wah' guitar effects."
                    },
                    "Heavy Psych": {
                        "Description": "Developed in the late 1960s with influence from Blues Rock, such as heavy dependence on riffs and willingness to improvise, adding crushing levels of heaviness with thick fuzzy guitars to create a doomy and morose atmosphere."
                    },
                    "Raga Rock": {
                        "Description": "Influenced by South Asian Music, featuring a droning compositional quality and commonly incorporating instruments like sitar, tambura, and tablas."
                    },
                    "Space Rock": {
                        "Description": "Heavy use of synthesizers and guitar effects to create dense atmospheric soundscapes intended to evoke images of outer space and science fiction scenarios.",
                        "Subgenres": {
                            "Space Rock Revival": {
                                "Description": "Type of Neo-Psychedelia that draws from the aesthetics and expansive sonic palette of Space Rock combined with the more minimal, back-to-basics approach of the Post-Punk era."
                            }
                        }
                    },
                    "Zamrock": {
                        "Description": "Zambian 1970s Psychedelic Rock found mainly throughout the Copperbelt region."
                    }
                }
            },
            "Psychedelic Soul": {
                "Description": "Soul which incorporates the effects and instrumentation of Psychedelic Rock."
            },
            "Stoner Rock": {
                "Description": "Psychedelic timbres, raw production, and stylistic influence from Doom Metal and Heavy Psych."
            },
            "Tropicália": {
                "Description": "Brazilian counterculture art movement started in 1967 blending Psychedelic Rock, Psychedelic Pop, and Experimental production with contemporary Brazilian pop, with the lyrics being left wing-tinted abstract poetry."
            }
        }
    },
    {
        "Genre": "Punk",
        "Description": "Musical and cultural product of Punk Rock known for its simplistic, brash playstyle and anti-establishment theme",
        "Subgenres": {
            "Art Punk": {
                "Description": "Combines the stripped-down aggression of rudimentary Punk Rock with frequent experimentation ranging from instrumental interplay, noise, dissonance, and/or influences from other genres such as Jazz or Funk.",
                "Subgenres": {
                    "Egg Punk": {
                        "Description": "Originated in the early 2010s; features lo-fi production, eccentric lyrics, quick tempos, nasally vocals, and cheap keyboard sounds."
                    }
                }
            },
            "Cowpunk": {
                "Description": "Mixes together Country Rock, Rockabilly, and Contemporary Folk with the familiar punk sound."
            },
            "Digital Hardcore": {
                "Description": "High-tempo fusion of Hardcore Punk and Electronic, combining harsh vocals and electric guitars of the former with electronic instruments."
            },
            "Emo": {
                "Description": "Focuses on emotional lyrics, expressive vocals, melodic songwriting, and dynamic song structures.",
                "Subgenres": {
                    "Emocore": {
                        "Description": "Emerged primarily in Washington D.C. in 1985 as a reaction to the stagnant Hardcore Punk scene, with a less aggressive style that was more melodic and often featured emotional, introspective lyrics."
                    },
                    "Emo-Pop": {
                        "Description": "Mainstream derivative of Emo, puts more emphasis on the poppy sensibilities of Alternative Rock and Pop Punk."
                    },
                    "Midwest Emo": {
                        "Description": "Features the emotional and melodic style of Emo that usually alternates between loud and soft dynamics; off-key, strained vocals with little screaming; and arpeggiated guitar parts."
                    },
                    "Screamo": {
                        "Description": "Began in the early 1990s, merging the emotional lyrics and melodicism of Emo with the intensity, aggression and speed of Hardcore Punk.",
                        "Subgenres": {
                            "Emoviolence": {
                                "Description": "Volatile, aggressive sound of Screamo with slight Powerviolence undertones."
                            }
                        }
                    }
                }
            },
            "Folk Punk": {
                "Description": "Influenced by various forms of Folk, including Traditional Folk Music as well as Contemporary Folk and Folk Rock.",
                "Subgenres": {
                    "Celtic Punk": {
                        "Description": "Infuses the sounds of Celtic Folk Music into Punk Rock."
                    },
                    "Gypsy Punk": {
                        "Description": "Strong Eastern European influences, especially various kinds of Romani Folk Music and Balkan Folk Music as well as Klezmer."
                    }
                }
            },
            "Hardcore [Punk]": {
                "Description": "Broad genre which originated in the late 1970s; early work featured simple songs that took the punk formula and produced its most extreme result.",
                "Subgenres": {
                    "Beatdown Hardcore": {
                        "Description": "Heavy, urban-inspired and breakdown-oriented with strong relations to Metalcore."
                    },
                    "Easycore": {
                        "Description": "Combines the pop choruses, high-pitched vocals, and playful nature of Pop Punk with heavy, metallic breakdowns and occasional unclean vocals akin to Metalcore and Post-Hardcore."
                    },
                    "Electronicore": {
                        "Description": "Infuses melodic aspects of Metalcore and Post-Hardcore with various styles of Electronic Dance Music."
                    },
                    "Grindcore": {
                        "Description": "Features shortened song structures and a diverse palette of intense techniques such as blast and skank beats, tremolo and down-picking, and various harsh vocal styles.",
                        "Subgenres": {
                            "Cybergrind": {
                                "Description": "Standard conventions of Grindcore taken to an even more discordant and rapid-fire extreme, with added Electronic dimensions of computer-generated noises and drum machines."
                            },
                            "Deathgrind": {
                                "Description": "Combines the intensity and high-pitched screams of Grindcore with the technicality and low guttural vocals of Death Metal."
                            },
                            "Goregrind": {
                                "Description": "Death Metal-influenced riffs with rhythms ranging from very fast to slower mid-tempos correlated with pitch-shifted vocals, sloppy playing and production, and gore-themed aesthetics.",
                                "Subgenres": {
                                    "Gorenoise": {
                                        "Description": "Combines and subverts Goregrind and Grindcore with brash Noise and even faster drum tempos."
                                    },
                                    "Pornogrind": {
                                        "Description": "Groovy, mid-tempo style known for its exaggerated bouncy rhythm and common pornographic themes."
                                    }
                                }
                            },
                            "Mincecore": {
                                "Description": "Raw and simplistic with heavy reliance on Punk structures while including political and socially aware themes."
                            },
                            "Noisegrind": {
                                "Description": "Noise-driven, defined by its rawness, feedback usage, and very brief song structures."
                            }
                        }
                    },
                    "Hardcore Punk": {
                        "Description": "Emerged in the late 1970s, often featuring extensive use of yelling or screaming, a stripped-down production style, and very short songs.",
                        "Subgenres": {
                            "Burning Spirits": {
                                "Description": "Emphasis on delivering a very energetic and triumphant sound with flashy and soaring Metal solos, 'melodramatic' or 'uplifting' chord progressions, and singalong, over the top, harsh vocals."
                            },
                            "Crossover Thrash": {
                                "Description": "Fusion of Thrash Metal and Hardcore Punk which started in the 1980s."
                            },
                            "Crust Punk": {
                                "Description": "Metallic form of Hardcore Punk that grew out of the Anarcho-Punk movement in the mid-1980s.",
                                "Subgenres": {
                                    "Blackened Crust": {
                                        "Description": "Borrows heavily from Black Metal production, blast beats, tremolo guitar, and vocals, while retaining the core Crust Punk sound, lyrical themes, and aesthetic."
                                    },
                                    "Neocrust": {
                                        "Description": "Melodic, dark, and atmospheric style that often incorporates influences from Sludge Metal, Post-Metal, Black Metal, and Screamo."
                                    },
                                    "Stenchcore": {
                                        "Description": "Heavier, more metallic form of Crust Punk drawing influence from Thrash Metal as well as Death Metal and Heavy Metal."
                                    }
                                }
                            },
                            "D-Beat": {
                                "Description": "Early 1980s Hardcore Punk featuring Metal influences and a distinct drum style also known as the D-beat."
                            },
                            "Japanese Hardcore": {
                                "Description": "Bands from Japan, performing styles such as Burning Spirits, Crust Punk, and Thrashcore."
                            },
                            "Melodic Hardcore": {
                                "Description": "Emerged in the USA in the early to mid-1980s, placing emphasis on melodic vocals and technical guitar riffs rather than raw aggression."
                            },
                            "Mincecore": {
                                "Description": "Raw and simplistic with heavy reliance on Punk structures while including political and socially aware themes."
                            },
                            "New York Hardcore": {
                                "Description": "Hardcore Punk bands from New York City from the 1980s and onwards."
                            },
                            "Skacore": {
                                "Description": "Fuses skank rhythms and frantic blasts of horns with hardcore intensity.",
                                "Subgenres": {
                                    "Crack Rock Steady": {
                                        "Description": "Fuses Skacore with elements of Crust Punk and sometimes Metal; coupled with anti-establishment lyrics."
                                    }
                                }
                            },
                            "Street Punk": {
                                "Description": "Driven by Oi! style group vocals, catchy melodies, and aggressive songwriting akin to Punk Rock of the 1970s fused with Hardcore Punk of the 1980s."
                            },
                            "Thrashcore": {
                                "Description": "Fast tempos, brief song structures, and the occasional use of blast beats.",
                                "Subgenres": {
                                    "Powerviolence": {
                                        "Description": "Originated from the West Coast California hardcore scene in the late 1980s utilizing strong elements of Noise Rock and random tempo changes in the context of Thrashcore."
                                    }
                                }
                            },
                            "UK82": {
                                "Description": "UK scene that occurred during the early 1980s, consisting of developing hardcore styles such as early Street Punk and D-Beat bands."
                            }
                        }
                    },
                    "Metalcore": {
                        "Description": "Drop-tuned guitar riffs, constant double kick drumming with varying tempos and techniques, breakdown sections, and screaming or shouting vocals.",
                        "Subgenres": {
                            "Deathcore": {
                                "Description": "Fusion genre integrating elements from Death Metal, using harsh guttural vocals, blast beats, and palm-muted or tremolo-picked riffs in conjunction with breakdowns.",
                                "Subgenres": {
                                    "Downtempo Deathcore": {
                                        "Description": "Slow and minimal songs emphasizing breakdowns, atmosphere, and dissonance with downtuned guitars."
                                    }
                                }
                            },
                            "Mathcore": {
                                "Description": "Rhythmically complex, features unconventional time signatures, syncopated and dissonant riffs and erratic metric shifts."
                            },
                            "Melodic Metalcore": {
                                "Description": "Originated in the late 1990s when some metalcore bands infused elements of Melodic Death Metal into their sound to create a more metallic and melodic style."
                            }
                        }
                    },
                    "Nintendocore": {
                        "Description": "Fuses Post-Hardcore and Metalcore influences with Chiptune instrumentation."
                    },
                    "Noisecore": {
                        "Description": "Short blasts of riff-less, Noise-driven music accompanied with chaotic drums and screamed vocals."
                    },
                    "Post-Hardcore": {
                        "Description": "Emerged in the mid-1980s from Hardcore Punk that expanded on its aggression and dynamics through longer and more complex arrangements.",
                        "Subgenres": {
                            "Emocore": {
                                "Description": "Emerged primarily in Washington D.C. in 1985 as a reaction to the stagnant Hardcore Punk scene, with a less aggressive style that was more melodic and often featured emotional, introspective lyrics."
                            },
                            "Screamo": {
                                "Description": "Began in the early 1990s, merging the emotional lyrics and melodicism of Emo with the intensity, aggression and speed of Hardcore Punk.",
                                "Subgenres": {
                                    "Emoviolence": {
                                        "Description": "Volatile, aggressive sound of Screamo with slight Powerviolence undertones."
                                    }
                                }
                            },
                            "Swancore": {
                                "Description": "High-register clean vocals and technical instrumentation drawn from Math Rock and Progressive Rock."
                            }
                        }
                    },
                    "Sasscore": {
                        "Description": "Emerged in the early 2000s; characterized by sassy vocal styles and chaotic, erratic instrumentals."
                    }
                }
            },
            "Mod Revival": {
                "Description": "Late 1970s and early 1980s revival of Mod fashion and music, featuring influence from the nascent Punk Rock scene."
            },
            "No Wave": {
                "Description": "Underground, avant-garde, anti-art movement and music scene based in New York City around 1976-1980; commonly incorporates elements like dissonance, atonality, and stream-of-consciousness lyrics into various genres."
            },
            "Post-Punk": {
                "Description": "Emerged alongside the initial Punk Rock explosion in the mid-to-late 1970s, putting a greater emphasis on frequent experimentation, atmosphere, generally stripped-back instrumentation and, at times, angular-sounding guitars, throbbing bass lines, and interlocked drumming.",
                "Subgenres": {
                    "Coldwave": {
                        "Description": "Originated in Europe in the late 1970s and early 1980s and is known for its generally dark, gloomy atmosphere and heavy reliance on synthesizers."
                    },
                    "Dance-Punk": {
                        "Description": "Mixes the energy of Punk Rock with the danceable rhythms of Funk and Disco."
                    },
                    "Gothic Rock": {
                        "Description": "Dark atmosphere and gothic imagery, featuring synthesizers and moderate use of chorus and echo effects.",
                        "Subgenres": {
                            "Deathrock": {
                                "Description": "More Punk-oriented offshoot of Gothic Rock that emphasizes energy and an effect-laden sound over pure atmosphere."
                            }
                        }
                    },
                    "Post-Punk Revival": {
                        "Description": "Incorporating the sounds and aesthetics of Post-Punk into Indie Rock, with jagged guitarwork, a dominant and danceable rhythm section, clean production, and poppy song structures."
                    }
                }
            },
            "Proto-Punk": {
                "Description": "Used to describe what influenced or in some way resembled Punk Rock before that genre's commercial breakthrough in 1976."
            },
            "Punk Blues": {
                "Description": "Fusion of the instrumentation and scales of Blues Rock with Punk."
            },
            "Punk Rock": {
                "Description": "Fast tempos, loud and distorted riffs, simple songs, frequent use of power chords, and shouted vocals, originating in the mid-1970s in response to commercial, sentimental, and complex Rock.",
                "Subgenres": {
                    "Anarcho-Punk": {
                        "Description": "In part a reaction to the commercial breakthrough of Punk Rock in the late 1970s, with some artists adopting an intentionally rougher and sloppier sound combined with lyrical themes of anarchism and related issues that gave the genre its name."
                    },
                    "Celtic Punk": {
                        "Description": "Infuses the sounds of Celtic Folk Music into Punk Rock."
                    },
                    "Deathrock": {
                        "Description": "More Punk-oriented offshoot of Gothic Rock that emphasizes energy and an effect-laden sound over pure atmosphere."
                    },
                    "Deutschpunk": {
                        "Description": "Partly a reaction to the commercialization of the German movement Neue Deutsche Welle; characterized by extreme speed, consciously basic songwriting, crude musicianship, and radical leftism."
                    },
                    "Egg Punk": {
                        "Description": "Originated in the early 2010s; features lo-fi production, eccentric lyrics, quick tempos, nasally vocals, and cheap keyboard sounds."
                    },
                    "Garage Punk": {
                        "Description": "Combination of the raw fuzztones of the original Garage Rock bands of the 1960s with the tempo and attitude of Punk Rock."
                    },
                    "Glam Punk": {
                        "Description": "Contrasts a snotty, nihilistic, and combative attitude of punk with theatrics and flamboyance."
                    },
                    "Hardcore Punk": {
                        "Description": "Emerged in the late 1970s, often featuring extensive use of yelling or screaming, a stripped-down production style, and very short songs.",
                        "Subgenres": {
                            "Burning Spirits": {
                                "Description": "Emphasis on delivering a very energetic and triumphant sound with flashy and soaring Metal solos, 'melodramatic' or 'uplifting' chord progressions, and singalong, over the top, harsh vocals."
                            },
                            "Crossover Thrash": {
                                "Description": "Fusion of Thrash Metal and Hardcore Punk which started in the 1980s."
                            },
                            "Crust Punk": {
                                "Description": "Metallic form of Hardcore Punk that grew out of the Anarcho-Punk movement in the mid-1980s.",
                                "Subgenres": {
                                    "Blackened Crust": {
                                        "Description": "Borrows heavily from Black Metal production, blast beats, tremolo guitar, and vocals, while retaining the core Crust Punk sound, lyrical themes, and aesthetic."
                                    },
                                    "Neocrust": {
                                        "Description": "Melodic, dark, and atmospheric style that often incorporates influences from Sludge Metal, Post-Metal, Black Metal, and Screamo."
                                    },
                                    "Stenchcore": {
                                        "Description": "Heavier, more metallic form of Crust Punk drawing influence from Thrash Metal as well as Death Metal and Heavy Metal."
                                    }
                                }
                            },
                            "D-Beat": {
                                "Description": "Early 1980s Hardcore Punk featuring Metal influences and a distinct drum style also known as the D-beat."
                            },
                            "Japanese Hardcore": {
                                "Description": "Bands from Japan, performing styles such as Burning Spirits, Crust Punk, and Thrashcore."
                            },
                            "Melodic Hardcore": {
                                "Description": "Emerged in the USA in the early to mid-1980s, placing emphasis on melodic vocals and technical guitar riffs rather than raw aggression."
                            },
                            "Mincecore": {
                                "Description": "Raw and simplistic with heavy reliance on Punk structures while including political and socially aware themes."
                            },
                            "New York Hardcore": {
                                "Description": "Hardcore Punk bands from New York City from the 1980s and onwards."
                            },
                            "Skacore": {
                                "Description": "Fuses skank rhythms and frantic blasts of horns with hardcore intensity.",
                                "Subgenres": {
                                    "Crack Rock Steady": {
                                        "Description": "Fuses Skacore with elements of Crust Punk and sometimes Metal; coupled with anti-establishment lyrics."
                                    }
                                }
                            },
                            "Street Punk": {
                                "Description": "Driven by Oi! style group vocals, catchy melodies, and aggressive songwriting akin to Punk Rock of the 1970s fused with Hardcore Punk of the 1980s."
                            },
                            "Thrashcore": {
                                "Description": "Fast tempos, brief song structures, and the occasional use of blast beats.",
                                "Subgenres": {
                                    "Powerviolence": {
                                        "Description": "Originated from the West Coast California hardcore scene in the late 1980s utilizing strong elements of Noise Rock and random tempo changes in the context of Thrashcore."
                                    }
                                }
                            },
                            "UK82": {
                                "Description": "UK scene that occurred during the early 1980s, consisting of developing hardcore styles such as early Street Punk and D-Beat bands."
                            }
                        }
                    },
                    "Horror Punk": {
                        "Description": "Horror movie-themed genre of Punk Rock."
                    },
                    "Könsrock": {
                        "Description": "Inspired by Post-Punk but with a more bizarre atmosphere with unusual or comic vocal techniques and a lyrical focus on the offensive and scatological."
                    },
                    "Oi!": {
                        "Description": "Rejection to burgeoning Art Punk; a much simpler and more melodic style."
                    },
                    "Pop Punk": {
                        "Description": "Blends the loud, fast-paced, and sometimes sloppy sound of Punk Rock with the catchy sound and songwriting of Pop.",
                        "Subgenres": {
                            "Easycore": {
                                "Description": "Combines the pop choruses, high-pitched vocals, and playful nature of Pop Punk with heavy, metallic breakdowns and occasional unclean vocals akin to Metalcore and Post-Hardcore."
                            },
                            "Seishun Punk": {
                                "Description": "Short-lived Japanese style popular in the early 2000s, characterized by a raw and abrasive style, Folk-inspired songwriting, and youth-oriented straightforward lyrics."
                            }
                        }
                    },
                    "Psychobilly": {
                        "Description": "Cross-pollination of Punk Rock and Rockabilly."
                    },
                    "Queercore": {
                        "Description": "Movement mainly distinguished by its lyrical content expressing the viewpoints of the LGBTQ+ community, as well as promoting queer pride and unity."
                    },
                    "Riot Grrrl": {
                        "Description": "Underground feminist Punk Rock movement and related scene(s) which emerged in the United States in the early 1990s."
                    },
                    "Ska Punk": {
                        "Description": "Characterized by up-tempo skank rhythms, catchy horn sections, and spirited guitar work; delivered with a fun and rebellious energy.",
                        "Subgenres": {
                            "Skacore": {
                                "Description": "Fuses skank rhythms and frantic blasts of horns with hardcore intensity.",
                                "Subgenres": {
                                    "Crack Rock Steady": {
                                        "Description": "Fuses Skacore with elements of Crust Punk and sometimes Metal; coupled with anti-establishment lyrics."
                                    }
                                }
                            }
                        }
                    },
                    "Skate Punk": {
                        "Description": "Combines the speed of Melodic Hardcore with the catchiness of Pop Punk, finding a middle ground between the two."
                    },
                    "Surf Punk": {
                        "Description": "Punk Rock that incorporates elements of Surf Rock."
                    },
                    "Vikingarock": {
                        "Description": "Incorporates influences from Nordic Folk Music and the imagery of Viking romanticism and Norse mythology."
                    },
                    "Synth Punk": {
                        "Description": "Appropriates the harsh elements of Punk Rock but replaces the predominance of guitars with synthesizers and drum machines."
                    }
                }
            }
        }
    },
    {
        "Genre": "R&B",
        "Description": "Umbrella of styles covering the most popular forms of Black American music from the late 1940s, when the term Rhythm & Blues first appeared; includes the developments of Soul and Funk in the '60s and '70s, and the Contemporary R&B of the 1980s onward.",
        "Subgenres": {
            "Acid Jazz": {
                "Description": "Eclectic scene consisting of influences from Jazz, Funk, Hip Hop, Soul, and various styles of Dance that gained popularity during the 1990s."
            },
            "Blue-Eyed Soul": {
                "Description": "Usually refers to a Pop or Pop Rock song that contains strong Gospel-like elements, primarily popularized by white American and British singers in the 1960s through the 1980s."
            },
            "Boogie": {
                "Description": "Continuation of the Disco sound with increased influence from Funk, Synth Funk, and R&B and a slower tempo, often featuring drum machines and filter modulated synthesizers."
            },
            "Contemporary R&B": {
                "Description": "Characterized by soulful, passionate and melismatic vocals originally derived from popular Soul and Disco, and by smooth, lush and often synthezised production variously influenced by Hip Hop, Funk, and related strands of Pop.",
                "Subgenres": {
                    "Alternative R&B": {
                        "Description": "Deviating from the traditional styles of Contemporary R&B and featuring smooth, reverberated, Electronic-influenced production with heavy bass and often reverberated vocals."
                    },
                    "Hip Hop Soul": {
                        "Description": "Hip Hop-oriented style that evolved out of New Jack Swing in the early 1990s."
                    },
                    "New Jack Swing": {
                        "Description": "Mixes light Hip Hop & Funk production techniques with Contemporary R&B vocals and melodies as well as swinging and danceable drum grooves."
                    },
                    "Trap Soul": {
                        "Description": "Mixes passionate vocals derived from Contemporary R&B with laid-back, nocturnal and atmospheric Trap production."
                    },
                    "UK Street Soul": {
                        "Description": "Emerged in the late 1980s and early 1990s; combines raw basslines and breakbeats with Contemporary R&B/Soul vocals."
                    }
                }
            },
            "Doo-Wop": {
                "Description": "Heavy emphasis on male four-part harmonies and light instrumentation; peaked in popularity in the 1950s."
            },
            "Funk": {
                "Description": "Strong danceable grooves typically carried by bass guitar and drums, prominent use of extended chords, and a percussive guitar style using a wah pedal.",
                "Subgenres": {
                    "Afro-Funk": {
                        "Description": "Strongly mixed with traditional and more modern genres in sub-Saharan West Africa."
                    },
                    "Britfunk": {
                        "Description": "Variety of Funk born out of late 1970s British nightclubs."
                    },
                    "Deep Funk": {
                        "Description": "Focuses more on grooves and rhythm than songwriting."
                    },
                    "Go-Go": {
                        "Description": "Dominated by drums and percussion (primarily congas) with heavily syncopated rhythms, bursts of horns, and call-and-response vocals."
                    },
                    "Jazz-Funk": {
                        "Description": "Jazz highly influenced by Funk."
                    },
                    "Latin Funk": {
                        "Description": "Funk combined with Hispanic American Music styles."
                    },
                    "P-Funk": {
                        "Description": "Features a 'fat', monotonic drum sound, spaced-out synthesizers, 'squelchy' basslines, tight, syncopated horns, and sometimes heavy guitars."
                    },
                    "Porn Groove": {
                        "Description": "Primarily found in the soundtracks to Pornographic films of the 1970s."
                    },
                    "Synth Funk": {
                        "Description": "Emerged in the late 1970s; replaces horns traditionally used in melodic segments with synthesizers, while often incorporating drum machines to augment the futuristic sound.",
                        "Subgenres": {
                            "Minneapolis Sound": {
                                "Description": "Emerged in late 1970s Minneapolis as a Synth Funk expansion characterized by glossy Contemporary R&B-influenced production techniques, angular New Wave-inspired rhythms, and a larger emphasis on electric guitar layers."
                            }
                        }
                    }
                }
            },
            "New Orleans R&B": {
                "Description": "Increased rhythmic complexity with added focus on piano and horns."
            },
            "Rhythm & Blues": {
                "Description": "Predominantly African American style that retains the defined backbeats, Blues chord progressions/melodies and passionate singing/shouting of Jump Blues, while appealing more to an urban audience with smaller bands and reduced Jazz influence.",
                "Subgenres": {
                    "British Rhythm & Blues": {
                        "Description": "A style infusing Rock and R&B that was hugely popular in the United Kingdom between 1963 and 1966."
                    },
                    "Swamp Pop": {
                        "Description": "Uniquely Cajun style of Rhythm & Blues distinguished by tripleted pianos and a slow Blues structure."
                    },
                    "Twist": {
                        "Description": "Simple, fast, and energetic dance popular in the early 1960s."
                    }
                }
            },
            "Soul": {
                "Description": "Originated in the African American culture of the 20th century, resulting from the combination of the ecstatic vocals of Gospel with the upbeat instrumentation of Rhythm & Blues, consisting of guitar, bass and percussion.",
                "Subgenres": {
                    "Chicago Soul": {
                        "Description": "Combination of the hard, groove-oriented rhythms of Southern Soul and the sophisticated gloss of the Motown Sound which was developed in Chicago."
                    },
                    "Country Soul": {
                        "Description": "Combining the gritty horn-driven sound of Southern Soul with the textures and aesthetics of Country."
                    },
                    "Deep Soul": {
                        "Description": "Draws on the typical Southern Soul groove and accentuates the Gospel and Blues influence, particularly Chicago Blues."
                    },
                    "Latin Soul": {
                        "Description": "Soul combined with Hispanic American Music, such as Salsa and Mambo."
                    },
                    "Neo-Soul": {
                        "Description": "Emerged during the mid-to-late 1990s; defined by a combination of Soul with the rhythmic percussion and groove of Hip Hop."
                    },
                    "Northern Soul": {
                        "Description": "Soul popular in northern England in the late 1960s and early 1970s, consisting primarily of lesser-known American artists in the mid-1960s copying the Motown Sound."
                    },
                    "Philly Soul": {
                        "Description": "Defined by lush arrangements, often borrowing upon the orchestral instrumentation seen on productions from the 1960s, with the commercial atmosphere exemplified by Pop Soul and the Motown Sound."
                    },
                    "Pop Soul": {
                        "Description": "Fusion of Pop and Soul; originated in the 1960s as an attempt to give soul crossover success.",
                        "Subgenres": {
                            "Motown Sound": {
                                "Description": "Succinct, catchy song structures; complex arrangements; Gospel-influenced vocals; highly melodic and rhythmic bass lines; 4-4 drum patterns; often syncopated piano parts; regular use of horn and string sections; and historically a distinctive reverb and treble-heavy production."
                            }
                        }
                    },
                    "Psychedelic Soul": {
                        "Description": "Soul which incorporates the effects and instrumentation of Psychedelic Rock."
                    },
                    "Smooth Soul": {
                        "Description": "Slow tempo ballads with silky, often sensual, vocals and light, polished arrangements, creating an intimate, romantic atmosphere."
                    },
                    "Southern Soul": {
                        "Description": "Soul primarily from the American South that was popular in the 1960s and 1970s, with a gritty and raw sound that places an emphasis on the groove, making it highly danceable."
                    }
                }
            }
        }
    },
    {
        "Genre": "Singer-Songwriter",
        "Description": "Heavily focused on lyrics and songwriting, with musical accompaniment tending to take lower precedence.",
        "Subgenres": {
            "Avtorskaya pesnya": {
                "Description": "Originating in the Soviet Union taking cues from forms of Russian Romance and Russian poetry with the main focus on lyrics.",
                "Subgenres": {
                    "Bard Rock": {
                        "Description": "Mixes Rock music and styles with Avtorskaya pesnya."
                    }
                }
            },
            "Canzone d'autore": {
                "Description": "Music of the Italian Singer-Songwriters that emerged in the 1960s and early 1970s, initially influenced by French Chanson with the addition of uniquely Italian sensibilities."
            },
            "Chanson à texte": {
                "Description": "French-language songs emphasising sophisticated and poetic lyricism."
            },
            "Euskal kantagintza berria": {
                "Description": "Basque genre born during the 1960s inspired by Nova cançó and Chanson."
            },
            "Kleinkunst": {
                "Description": "Dutch-language genre from the Netherlands and Flanders with influences from Cabaret, protest songs, Chanson, and folk."
            },
            "Liedermacher": {
                "Description": "German style having its origins in literature and theatre rather than American forms like Blues or Rock."
            },
            "Música de intervenção": {
                "Description": "Wave of Portuguese singer-songwriters in the 1960s and 1970s who agitated against the Estado Novo regime and the colonial war waged by Portugal against national liberation fronts."
            },
            "Nova cançó": {
                "Description": "Arose in Catalonia during the Franco dictatorship, sung in Catalan as a way to resist restrictions placed on regional languages in Spain and retain a regional identity."
            },
            "Nòva cançon": {
                "Description": "Arose in the Occitania region of southern France, sung in the Occitan language as a way to preserve their culture and resist forced usage of French."
            },
            "Nueva canción": {
                "Description": "Latin American (Nueva canción latinoamericana) and Spanish (Nueva canción española) movement during the 1960s and 1970s.",
                "Subgenres": {
                    "Nueva canción española": {
                        "Description": "Arose in Spain in the 1960s, inspired in part by Nova cançó's reclaiming of Catalan regional identity, that spread across the country in regional variations."
                    },
                    "Nueva canción latinoamericana": {
                        "Description": "Politically-charged messages associated with the rise of leftist social movements; striving for a renewal of traditional Latin and Hispanic American Folk Music expressions.",
                        "Subgenres": {
                            "Nueva canción chilena": {
                                "Description": "Socially conscious style that sought to recover traditional Chilean folk music and fuse it with the broader musical trends of Latin America.",
                                "Subgenres": {
                                    "Nueva trova": {
                                        "Description": "Found inspiration in the 1950s Cuban Revolution and had the intention of introducing new musical ideas to the original Trova."
                                    },
                                    "Nuevo Cancionero": {
                                        "Description": "Musical-literary movement in Argentina that aimed to reevaluate and reinvigorate 'la música popular nativa' (native popular music) and to be the voice of poor and marginalized Argentines."
                                    },
                                    "Poezja śpiewana": {
                                        "Description": "Polish sung poetry; the poem is the centerpiece of a song, often with sparse instrumental accompaniment."
                                    }
                                }
                            }
                        }
                    }
                }
            }
        }
    },
    {
        "Genre": "Spoken Word",
        "Description": "Usually unaccompanied vocal readings.",
        "Subgenres": {
            "Fairy Tales": {
                "Description": "Recorded for children with or without background music."
            },
            "Folktales": {
                "Description": "Traditional stories passed down throughout many generations."
            },
            "Guided Meditation": {
                "Description": "Practice wherein an instructor guides the listener through the process of meditation throughout a session."
            },
            "Interview": {
                "Description": "Recording of a specific person/s during a formal conversation arranged for historical archiving or media broadcast, often in a question and answer format in which the interviewee shares their views and personal anecdotes with the audience."
            },
            "Lectures": {
                "Description": "Oral presentation with the intention to educate the audience on a specific topic."
            },
            "Poetry": {
                "Description": "Encompasses many forms of literature that use style and rhythm to evoke ideas and emotions further than the prosaic meaning of the literature itself.",
                "Subgenres": {
                    "Beat Poetry": {
                        "Description": "Stream-of-consciousness Poetry originating with the Beats in the 1950s."
                    },
                    "Cowboy Poetry": {
                        "Description": "Descended from the oral traditions of cowboys and ranchers, written with traditional use of rhyme and meter, using humor and slang, and primarily concerning the cowboy profession, lifestyle, and legacy."
                    },
                    "Dub Poetry": {
                        "Description": "Performance of Poetry over Reggae and Dub rhythms, which originated in Jamaica in the 1970s."
                    },
                    "Jazz Poetry": {
                        "Description": "Emerged in the 1920s, incorporating the style and rhythms of Jazz as both art forms spread throughout African-American communities in the United States."
                    },
                    "Slam Poetry": {
                        "Description": "Developed in the US during the late 1980s and early 1990s with the growing popularity of poetry slams, a form of poetry competition in which competing performers recite poems in front of a crowd."
                    },
                    "Sound Poetry": {
                        "Description": "Emphasis is placed upon phonetics and the sounds of syllables rather than the meaning of the words themselves."
                    }
                }
            },
            "Radio Drama": {
                "Description": "Narrative storytelling performed by voice actors and produced for radio broadcasting or published on audio media such as tapes or CDs."
            },
            "Speeches": {
                "Description": "Rhetorical acts performed publicly wherein a speaker typically monologues around a particular topic."
            },
            "Stand-Up Comedy": {
                "Description": "Comedy where the performer speaks directly to their intended audience, with origins beginning in the late 19th century."
            }
        }
    }
]